{"review_id":"8aoJJdKEO3ypoZNszpPu7Q","user_id":"bGgAL09pxLnV_FFgR4ZADg","business_id":"ZBE-H_aUlicix_9vUGQPIQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"We had my Mother's Birthday Party here on 10\/29\/16. What a Great time we all had. The food, music and waiters were Great!!! Thanks Lyles!!!","date":"2016-11-09 20:07:25"}
{"review_id":"Mt1yqQaBe9LZ-udbTDtKbw","user_id":"TupgQ2-vhT7xiDp9gflVjg","business_id":"l07ctcrDMV--TYwe3uzebQ","stars":1.0,"useful":1,"funny":4,"cool":2,"text":"VARY BAD SERVICE(the manager) AND LITERALLY ASK ME FOR 10% TIPS. like are you serious?? Went there with family tonight. The servants were alright. I went up to the lady manager and asked for some more fish cake and the raddish, she said 'okok' without even lifting her head and continue does her own stuff (talking+laughing with the servant beside her). I literally stood there, holding the 2 side dishes, for a minute straight. She pretty much ignored me in the first place. When I went up to pay my bill, it was $60. Gave $100, she return back a $20, a $10, a $5, a toonie and some loonies. I left $3 on the plate and ready to go, she immediately stopped me and pointing at the receipt saying '60, 60 dollar, 10%, 10% tips'(kept on repeating the word 10 percent) Since when tips option become a law?? I literally told her I'm not satisfied with her service and that has nothing to do with her servants but her. The food were okay but I would not go back to this place because of this lady manager.","date":"2016-11-23 05:54:25"}
{"review_id":"eL1vvuSPUnLjbG86QZz3sQ","user_id":"Tpbv__giCYB64LH6tuGiGg","business_id":"2xrpo-LXV9uGIwpvy0dwUw","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"The guys and gals at Classic Car Spa regularly deliver a great performance. Bring my Tesla here for some TLC and the wife's ride as well. Happy wife - Happy life. Check them out on Living Social for a trial. You won't regret it.","date":"2015-06-19 19:52:46"}
{"review_id":"3zIIHMC4rn1wCDynJJASrw","user_id":"NWrecl5hjADiE3eRt-8jjA","business_id":"uhyDNWYRSsom3VrFgOgP_w","stars":1.0,"useful":5,"funny":2,"cool":1,"text":"I was craving some Falafels and i decided to stop in. It was empty, which is never a good sign. But i went for it anyways. I ordered the Chicken Shwarma(for my daughter) and the Falafel platters with half rice and half salad.  My food came out pretty fast and the presentation was promising. I took my food to go and as soon as i got to the car i could not help but to dig in. Everything, i mean everything was super bland. The rice, the falafels, the hummus......#blandasfuck. The only thing that had any hint of flavor was the tzatziki sauce. I am super pissed i pay 24 dollars for some whack ass food.  I give this 2 thumbs down and some sea salt to season the food.","date":"2016-03-26 21:42:00"}
{"review_id":"YH2KuUvyvyNy0JpXj-seMg","user_id":"3EIc7WAoiojTFdy3TGOMfQ","business_id":"IzcL0KZPKqMbjoIaCmClog","stars":1.0,"useful":59,"funny":28,"cool":9,"text":"This review is not for the shooting range, but for the instructor, Rick Barkett, who conducted our CCW course a few months back.\n\nThe entire class of about 50 people were in agreement, when I say that this guy is a MAJOR FUCKING ASSHOLE.\n\nHe was clearly disgusted that so many people, many of whom weren't very knowledgeable about firearms, could be attending a class for a concealed carry permit.\n\nNow, I would agree that some of them should know more about their pistols & revolvers before they try to carry them around in their back pockets, but since we live in a country where we still have the right to bear arms, and they were attending a class to follow legal protocol, I'd say that this guy should just shut the fuck up and teach his class without passing so much judgment on the students.\n\nIf nobody asked a question, he had a smart ass remark about that.  If somebody asked a question, he had an equally smart ass remark.\n\nDuring the shooting portion of the training, he was totally condescending towards everybody, although he did shut the fuck up with me when he saw all 15 of my bullseye shots!!\n \nThere was one guy who actually wanted to slash his tires after the course but reconsidered because of all the surveillance cameras at the joint.  THAT would have been funny.\n\nIf I ever see his name again for a training class, I'll be sure to skip it and attend elsewhere.","date":"2012-07-30 22:53:21"}