{"0": {"review_id": "ECFAdWiS0VO9UP9_prN4uQ", "user_id": "Z2LBvTS86wBMoDCvd7fdsA", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "I was utterly disappointed by their service. The tables were not cleaned. There was rice and water on the chairs. We found ourself a half cleaned table and when I was halfway done eating (10:40pm), I was told by the waiter that we are closing in a few minutes. I gave her a look basically stating do you want me to stop eating.. She again came back in 5 mins stating we have to turn off the lights. At that point I just got up and left. I told her while leaving that they should have just told me at 10:20pm (when I arrived) that they are not taking orders. I am surprised this place is still open with this kind of service. Better go somewhere else.", "date": "2018-09-14 03:31:27"}, "1": {"review_id": "p2O-0uZPf1LhGYjrCa-k0g", "user_id": "sxgQMGPVU6SaMcqnEp3ajA", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 1.0, "useful": 1, "funny": 1, "cool": 1, "text": "Went here yesterday and ordered a barg kabab and chicken breast and a bolani. The bolani was undercooked and had absolutely no filling in it like none whatsoever. Was told that \"This is how we make it.\" It was literally the worst bolani I have seen. The barg kabab was also not cooked all the way through that we only found out when we got home and ate some. There was another lady behind us who complained about the portion sizes and the salad. The salad we got was less then half the box and consisted of 1 cucumber slice and the end of a tomato that you would normally throw out. Was given another box of equal quantity of salad after complaining about it. Their orange sauce was doused in hot sauce and completely undigestsble unless you are into super spicy throat burning sauce. The lady returned the food and got her money back and I am thinking I should have done the same. Definitely will not be going back. The cooks have definitely changed because it used to be good. I might have given it another chance if it was not for that other lady and her recent experience.", "date": "2017-10-24 21:46:15"}, "2": {"review_id": "XCDW-ZtFc8bWLK1EcxuNGg", "user_id": "wd0uUNvtEFDfNzoI44Om-w", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 2.0, "useful": 1, "funny": 0, "cool": 0, "text": "Went to this restaurant last week. We ordererd.. 1) yogurt salad (it was average) 2) green salad (average) 3) barj kabob (Delicious) 4) lamb chops ( thats where the two stars came from) Very disappointing. First of we ordered two olates of lamb chops one medium rare and one medium. Now the concept is you order at the cash and then they will call you and you pick up the food and seat yourself. So the cashier called us and i went up there to get my two orders of lamb chops. And she said \" oh the cook forgot to cook the one medium rare and just cooked both medium\" like seriously instead of redoing my order and get the temperature i asked for they just gave me the wrong temperature so it doesnt come out of their pocket. Second the lamb chops were not even cooked medium they were medium well and too hard to chew and its just tasted awful and dry. Will not be back except for the barg kabab that they have.", "date": "2016-10-26 20:07:20"}, "3": {"review_id": "Zkxq7RQsULZ8ZF0YyvPE5A", "user_id": "XPiyX7qxLKAulOuApW4Mog", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 5.0, "useful": 0, "funny": 0, "cool": 2, "text": "I and family went to their This new location. Wait was aprox 45 min. I guess they were short staffed that day. I tried their quail kabob and rice. It was spicy but really really tasty. Everything was done to perfection. Best place to eat Afghan food. Reasonably priced.", "date": "2015-08-06 23:14:09"}, "4": {"review_id": "RFZ7GXkdKd0_8CkJmaDfmA", "user_id": "0AnezUtzwmaeAYSMvDdLmg", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Having driven by this place on numerous occasions for the past 5-6 years, finally decided to stop and try the food. I have tasted Afghan food at other places and I have always liked the kebab and rice, so I knew this would be good, I was not wrong! We arrived around 715pm which was perfect because we missed the crowd that followed us. It is Ramadan and fasts were being broken. Decor (3/5) The place is nice. It tries to be fancy with the chandeliers but it does not work. Some great pictures and images on the wall depicting Afghan life and culture. We sat in a booth, and my seat was slightly tilted foward which is very annoying. Service (4/5) Here you place your order first, sit down, and they will call your number. The staff were friendly and accommodating. Food (4/5) Just as expected the food was delicious. They give you so much that you will have to pack a parcel for home. We ordered the sultani kebab and the Kandahar Kebab. Both were good, the little orange spicy sauce was yum. The place was soon busy and got packed. Great place to bring the family for some good Afghan food.", "date": "2018-05-19 02:52:03"}, "5": {"review_id": "ht5GWy6W1tDfJMVc9cYUXQ", "user_id": "sBnOdYrLYTqBp42VXvAarQ", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Hands down the best kabob place I have had in Scarborough. The line up might get long in peak hours buts it's so worth the wait. Although their beefs kabobs are great I love the chapati kabob. Can never go wrong with the chapati kabob, order it on your next visit!", "date": "2017-10-25 02:40:47"}, "6": {"review_id": "dH4ETv3clcy3ASDRGjWv7A", "user_id": "M3vHHg7nYbR1uZexEbxd_Q", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "Came here with some friends and thoroughly enjoyed it! The portions were huge, the rice was tasty, the meat was juicy. I find that this place is much better value than Bamiyan kabobs. Looking forward to coming again.", "date": "2018-01-22 03:42:22"}, "7": {"review_id": "a6CGoByJDsZb7wGQbqjRIw", "user_id": "jcriwcTidug0fK8sgAloHA", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "The food here is very similar in style to Bamiyan. It even has a similar style of ordering food and they call out your number when it is ready. You can choose to sit in or take out. There is a lot of space to sit inside. We grabbed our food to go. We ordered one of the chicken breast dinner and the veggie kabab dinner. They both came with A LOT of rice, salad, naan, as well as a creamy fill sauce and hot sauce. The chicken was in a sauce that was absolutely delicious. It reminded me a bit of piri piri sauce. Very flavourful. The rice is very similar to bamiyan as well. Brown long grain basmati. The salad was a nice way to balance all the carbs and protein. I used the creamy doll sauce on both the salad as a dressing and on the food. It was DELICIOUS. I would go there just for the sauce. The hot sauce was also really tasty. It had so much flavour and it was actually spicy, unlike Bamiyan's hot sauce (which is not even what I would consider mild anymore). I was impressed. The naan was also good but nothing special. The veggie kabab was nice. It held together very well. It reminded me of a veggie patty. There were quite a few spices in it and it is a great option for any vegetarians out there. I personally would not order it again, but only because there is one spice in there that I cannot stand, but it is present in quite a few Indian dishes as well. I forget the name. Overall the portions were massive for the price and quality of the food was very good. I could not even finish it all the 2nd day. I did feel like they give too much rice. It was a little disproportionate. We did wait quite a while for the food, but I did not mind, as long as the food was being prepared fresh. I would definitely go back, maybe order one dinner with rice and the other without and just split the amount between two people. I highly recommend the chicken breast dinner for those who enjoy a lot of flavour.", "date": "2016-12-20 01:18:27"}, "8": {"review_id": "nQueabo6aCZz4enuTpOlwg", "user_id": "lZXCUgpBBsnbN7926Y3g0A", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "The food is better than Bamyan and Naan/Kabab ! Portion size is a lot bigger, I never regret going there all the time. Food is great. atmosphere is very noisy and so many people come there. Try to avoid weekends if you want to eat in peace!!", "date": "2017-09-21 19:09:39"}, "9": {"review_id": "3rCdkQlLOK31eXlrrHwEGQ", "user_id": "9Dv1e0MjnVf9bDlfzmyLRg", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 4.0, "useful": 0, "funny": 0, "cool": 1, "text": "Stumbled upon this place after going for a hike at Rouge Park. This place was on our way home, and the 4 star rating and photos on Yelp helped us make the decision in coming here. The only other Afghan restaurant I have tried is Bamiyan Kabob. This place was pretty similar. Upon arrival you are greeted with 2 huge fountains and pretty lighting fixtures. My son loved them. The restaurant is huge and decorated nicely. Lots of spacing. We visited on a Sunday afternoon and it got really busy after we ordered. Lots of families! The ordering is also similar to Bamiyan, where you place your order at the cashier and then they will announce when your order is ready over a microphone. The wait was a bit long, but the food made up for it. Our chicken combo came with salad, rice, and naan with hot sauce and a white yogurt-like sauce. Rice was great, naan was warm, salad came with cucumbers and sliced tomato, and the chicken kabob was delicious. The chicken kofta was also good, but kabob stood out more. Will definitely return to try out other items on the menu!", "date": "2015-10-25 23:00:04"}, "10": {"review_id": "shD1m5TwZyWBpUVJH7dGLw", "user_id": "ZWCdRLRH5hfh5qCA_s38-A", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "This place has an interesting mix of a areal restaurant' environment and McDonald-style self-service, with the plastic trays and everything. The food portions are big, and the meats are well-marinaded - I'd describe it as an above-average food court fare.", "date": "2016-06-25 06:39:30"}, "11": {"review_id": "7JqjNtyebtzb7X_oI11PNw", "user_id": "14A9Vq8qUJ0m-s4B-Ek44g", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 1.0, "useful": 3, "funny": 0, "cool": 0, "text": "Let me start off by saying that I do not eat meat. we checked their website and they have a special section for their veggie food. we found out that they do not have veggie options available on their menu. so I did not order anything since the person who was putting in the order was not accommodating enough to mention any other options. after my friends got their food, they asked for a spoon. the spoon was taken right out of a water/liquid bucket and dried with a hand towel infront of us and given to my friend. so disgusting. poor service and messy place with the harsh kabob odor.", "date": "2016-04-14 01:54:02"}, "12": {"review_id": "P7j3P0EQKIDVWMtvdVnDhg", "user_id": "cdpO0F0kGP07FVCRp8RBXw", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "I get the chicken kababs and the veggie soy kebab - which in itself is an amazing idea for vegetarians. The food is fresh, flavourful and spicy. The chicken is good quality white meat. The sauce that comes with your order is delicious and spicy. It's too good. This pricing is a little expensive, but the food IS good. But it could use a dollar less on all the main dishes. I have not eaten dine in here, but went to get take out. The restaurant looks new, with nice waterfall pillars and lighting and etc. totally a step up from the old restaurants here. I just do not like the wait for the take out. Perhaps I should call in next time to place an order so I can come, collect and pay.", "date": "2015-07-06 14:02:29"}, "13": {"review_id": "2OhUddv0r0RBmwtXedCKoQ", "user_id": "4XqNefDRk2LBq71xTt9xCg", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 1.0, "useful": 1, "funny": 0, "cool": 0, "text": "Worst service on earth! went there at 8:45 and ordered a dinner plate, a skewer of kandahar kabob and a drink. That order ... which was supposed to be ready in 15 mins according to the cashier took an HOUR to come! there was no apology or explanation as to why the order was taking so long. the servers did not know what the hell they were doing and worst part is the people who ordered after us got their food delivered before us. Supposedly, they give more importance to the \"eat in orders\" and give little to no importance to the people doing take out! our order was 163 and orders 173,171,170,168,169,167 etc were all being served right in front of us. Now onto the food, nothing great, not even decent. kabob was dry, rice was very little and bread was despicable. Please do yourself a favour and go to ANY other afghan restaurant ... there are so many good ones like naan and kabob, bamiyan etc. This is a joke of a restaurant with idiots working in it. Dont even deserve half a star let alone a one star.", "date": "2015-05-02 02:33:03"}, "14": {"review_id": "HulUGU4US4ikb9z2zcNing", "user_id": "PS57qKDqNUlsLlsOxF00qg", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Excellent flavour and great value for money. We are big and of the Sardari kabob meal ( chicken) and the House special - Kandahar kabob (meat and comes with grilled vegetables) Ordering takeout can be a challenge as it's busy for them and they never came seem to hear despite yelling into the phone - but the meal is worth it.", "date": "2017-07-19 00:47:48"}, "15": {"review_id": "NxNydzt-XpnDmPaUMO-o2Q", "user_id": "6OLWTW2ojqUP_THBFs0s8w", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "This place was horrible, and the food was dry. I ordered the chicken kebab but only got one skewer of the kebab. Not only that, but it was sooo hot inside, and the AC was not turned on. Overall, I had a terrible experience and would not recommend this place. Food quality is NOT good.", "date": "2017-08-16 19:50:47"}, "16": {"review_id": "Bth9oR8mJOQKnAZxyPvO2g", "user_id": "hra3pYn0j8ZG4iY2rkiflA", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "This is my 2nd time here. The first time i did not notice anything as the crowd and line up was shorter. The food is pretty good but all of them go down the drain as the service is horrendous. First of all there are 3 servers and cashier who is completely clueless what to do. Instead of one person taking orders, and 2 person handing the food out to the customer, they have 3 of them doing the same thing and often time confused themselves. How can you get confuse at the things you are doing repeatedly? Not sure how hard is it for them to get the naan, sauce, drinks and salad dressing. I mean does not take a rocket scientist to do that. And the big no-no was when they handled the food with their bare hands and then touched everywhere in the counter and the cash register. I mentioned several times, please do not place your finger in the food, please use a gloves or tongs, they just ignore it and continue putting their finger into everyone's food and then use the same finger to touch the cash register and anywhere around the counter. They have great potential but run by kids who have no idea what they are doing. Basic food cleanliness and hygiene people! Come on! Oh ya, when the counter ran out of space to put the take out food, they decided to put the food on the floor!. ON THE FLOOR!! then when customer came back to pick up the food, they just pick it up on the floor yet the customer who saw it say absolutely nothing about it. Are you kidding me? Is it me? Well, there you have it, this place nasty but food taste good. Sorry that to me is like eating from the toilet bowl. YUCK!", "date": "2017-12-19 05:53:29"}, "17": {"review_id": "jXnP_bbxeCp4rUack4Gp1w", "user_id": "YBm1uenUPIieEz9_YVO67w", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "The food is good, not great but good. They have 3 veggie options but the veggie mantoo and that potato folles bread is never available. The service is hordenous. I had a take out order and the chef in the back literally had to tell the server 3 times to just hand me my meal so I could go. Even he was annoyed! I would never go out of my way to go here.", "date": "2017-04-09 21:42:45"}, "18": {"review_id": "jq2vYH2P-8DZi9ZDjbw-Jw", "user_id": "F3dKpfp0EpxkL-rDZSKzvA", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Eric C was right this place is indeed superior to Bamiyan. Nice Afghan kebab spot at Markham and Finch. Most definitely worth a try if in the area or craving kebab in the East end. Tried the bar kebab and the meat itself and the spiced sauce tasted great together. Try this place out you will not be disappointed.", "date": "2016-06-14 20:34:25"}, "19": {"review_id": "inhgSuU0t2xcg7Hoxdt_kA", "user_id": "1Z6Fm0Pp98QWTZ022n88ow", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Had one of the best meals in a beautiful Afghan restaurant. The experience made me feel like I was a royalty. Guaranteed to please all foodie senses out there. They have awesome hot sauce dips and their meats are cooked well. Scarborough deserves this beautifully decorated restaurant for family & friends to enjoy", "date": "2015-04-30 21:18:37"}, "20": {"review_id": "CTBLiGoXdYnPC1WKuE_7ig", "user_id": "6zsuSuLEwhUNHEWSDJqt-Q", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 3.0, "useful": 1, "funny": 1, "cool": 1, "text": "Few reviewers liked this place better than Bamiyan's, I would like to differ. I would agree that they have huge portions. Their menu is good too, you may taste two different types of kebabs in the meal but I believe that the kebabs at Bamiyan taste much better. The food here is amazing value as I was only able to finish half of it. I took a parcel to eat it next day, but did not feel like it as the taste was okay at best. It was a little too salty for me.", "date": "2016-10-03 00:04:41"}, "21": {"review_id": "0coZzj3ejE5q4iF4MJTbzQ", "user_id": "ror2PqjIt4HtGv2EgqoQTg", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Best afghan food in the city by far, better than Bamiyan. Food: If you are coming here for the first time try the \"Sardari Kabob\", It's a chicken breast and kofta kabob combination, you can have the best off both worlds on one plate and its marinated to perfection! Get extra garlic and hot sauce because that's one of the reasons I come here! Avoid the KK fish though, looks delicious but its super dry! Atmosphere: Very cute! However it is cafeteria like style, you order your food at the front... when the food's ready they call you to pick it up. There are no servers! Service: Can be improved, cashiers are not really that friendly.", "date": "2017-08-27 00:35:41"}, "22": {"review_id": "M9-DVanvCktQNjy18dRB6w", "user_id": "IZmx7AxIH3LeI1QMsrOAcQ", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Food was excellent here! Would definitely return. We just happened to catch them on a bad day when the electronic system was not running very well...difficulty with payments and ordering leading to a 35 minute wait. But it was totally worth the wait with succulent meat that was well cooked. I highly recommend the Chapli kebab. Great for something with a little bit of spice.", "date": "2015-05-30 02:11:06"}, "23": {"review_id": "GmEO-w467IKdd6XOgH1h-w", "user_id": "fpLbaNVVhSw3PktpHtZTEQ", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 4.0, "useful": 1, "funny": 0, "cool": 1, "text": "Massive serving size (always packing some take home). Good quality food. My family patrons this place often... for the price you can not go wrong.", "date": "2018-07-19 17:07:37"}, "24": {"review_id": "RBmuTSkth0ZO1omaebYUsg", "user_id": "45bBPN4Ch6yzaLNtB00M6A", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I love the food here! Everytime I am in Toronto I try to stop by. They make the best kebabs! Hands down! I usually get the chicken breast and ground chicken kebab skewer combo and have not been disappointed each time.", "date": "2018-09-06 23:04:30"}, "25": {"review_id": "tgtu2BgxvmNnJg2lHGIqKw", "user_id": "OorTVYJpEhZbnf3Oh_G5lw", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "First, the Good: 1. Good food 2. good decor Now, the Bad: 1. bad/rude service; no \"please\" or \"thank you\" EVER....to the cashier girl, if you do not like working there, get another job.... 2. Ordering process is too slow with hordes of people hanging around the cash register waiting for their food making it difficult just to order and pay for food....this despite the place not being busy. Even though no one was ordering food, we had to wait 5 minutes before the cashier took our order....there is no way I would eat here if it was even remotely busy. 3. sometimes your meal comes with bread and sometimes it does not....no consistency. When we asked for our bread, the cashier simply grab the bread with her bare hands after handling money all afternoon...this is disgusting. I only have patience to eat here about once a month given the issues noted above. Some of my office colleagues will not go there because of these issues.", "date": "2016-04-27 17:08:38"}, "26": {"review_id": "HRU9Du-6O8ao_yQ26yxtIA", "user_id": "1zoenxehqs5enWxtcRfXyg", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Bring your appetite as portions are a fair size as well as your patience. I had dinner here on the weekend and it was very busy. Customers were placing their take out/dine in orders over the counter and the lineup moved slowly. Two thumbs up for the chicken kebab as it had a good flavour served with plenty of rice.", "date": "2017-04-09 23:36:10"}, "27": {"review_id": "pR3myQnMkJVwug56KdAxBA", "user_id": "zIY3yXDH2rvQJRu79VPbGw", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "huge portions for a plate for $11.30, and they take credit card without additional charge as well. The portions for dining in, I perceived it to be bigger than ordering take out. Note: -small salad portions (From other places, its a big salad portion and small rice, but this place is the other way around). -Long wait for food, but it's understandable seeing that it looks like they doing everything by the order and fresh. -does not give enough sauce.", "date": "2018-09-29 02:52:17"}, "28": {"review_id": "upxqEFDv7Iyygp8lWXeCXQ", "user_id": "7BDr7fjotbLeehmbdinrqg", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "This place is disorganized. I came with family on a Sunday. Half the items on the menu are not available. They seem to have run out of the Chapli Kabab. Boulanie. No kabli palow. Etc. Etc. I would not recommend this place and will not be coming back. Slim pickings on the menu. No accommodations. No apologies. Go to another Afghan restaurant.", "date": "2018-03-05 21:55:55"}, "29": {"review_id": "BQ2zUnzp4z_1JyknWEzABA", "user_id": "oC1DqKq48Y4Jx-ZfYJ_r0w", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 3.0, "useful": 1, "funny": 0, "cool": 1, "text": "First time having this food and I ordered the chicken kebab plate with just salad. The order was a good size and the chicken and sauces provided (the hot sauce and salad dressing) were full of flavour. The reason I am giving this a 3/5 was because the salad was just iceberg lettuce, cucumber and tomato...I was really hoping for some other items true to the traditional offerings. I would go back because it did have good flavour.", "date": "2018-07-30 18:48:36"}, "30": {"review_id": "ignQzVQrO-4ffvn2H8v2GA", "user_id": "rciBA9ccwp8TUBa-mj0Ilg", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "The rice was cold and the kabobs were burned,, never coming here again ... for best Afghan food and best customer service go to naan and kabob restaurant...", "date": "2017-10-08 22:35:31"}, "31": {"review_id": "MsCmGR92OWYsp7NyLr4CiQ", "user_id": "UXpTrzITc0yg08sXftsa-w", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "Really enjoyed this place. My sister kept talking about it so we decided to give it a go. Their portions are big so be prepared to pack some up or share with someone. We got chicken kebabs combo, quail combo and a wrap. The meats are super juicy, tender and well marinated. The rice is moist and fluffy. The naan is not your typical naan, it's a little harder, smaller and thicker but nonetheless really good. I am absolutely in love with their hot sauce and garlic sauce. If I can get a pail of each and eat it with everything, I would. Service is self-serve (food court) and a little slow but I think it's because they make all their meats fresh to order so we did not mind waiting longer even though I was starved. I would definitely come back!", "date": "2015-11-23 16:25:07"}, "32": {"review_id": "2hjVb_KYGnJYqkFcV6FONw", "user_id": "lc-QzR-Az2isRwfDp_xXgw", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Kandahar kabab and Chicken breast kabab are my favorites. Very busy on the weekend nights, be prepared to wait for 45-60 minutes after ordering.", "date": "2017-07-14 00:05:26"}, "33": {"review_id": "3hOxC3_kAZebWrJHSGzzPQ", "user_id": "xDtrecOuYEga6v49EEILcg", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 3.0, "useful": 2, "funny": 2, "cool": 4, "text": "A popular Scarborough self-serve fast food place. Self-serve as in there are table seatings but you order your own food at the counter like any fast food restaurant but you have the choice of siting at the restaurant with real plates and cutlery. Their portions are generous and pricing are fair. They are relatively new. Their interior design is nicely done. They also have a point system to receive free items. Overall, I'd come back for a meal or two. Their dishes typically come with salad and rice. They take credit/debit/cash", "date": "2016-09-10 03:26:33"}, "34": {"review_id": "PC1y3kiQDi0TeP_VLynOZg", "user_id": "hcuGW5z4KP711m2YzTHnvA", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 2.0, "useful": 1, "funny": 0, "cool": 1, "text": "Food quality is good. Nice juicy kebabs and flavorful rice! But bit pricey considering it is not a full service restaurant. It is a self service place, with options for take-away or dine-in. Meal for two costs anywhere above $32. I do not like the fact that not even water is served. Service quality is extremely slow. An order takes around 20 to 30 minutes to be served. (when the restaurant is almost empty and it was not in the rush hours)", "date": "2015-10-26 17:51:16"}, "35": {"review_id": "Z6cvRuqC-4ggwcKttq5vsQ", "user_id": "JPvQM2_0Z21u8n9Hnv56Fg", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 3.0, "useful": 1, "funny": 1, "cool": 0, "text": "Environment was very fancy. They had very good, we will portioned food at a reasonable price. I got the kandahar kofta chicken skewer which was juicy and flavourful along with the spicy and white sauce. I was just disappointed with how hard the naan was. Seems like they may have reheated it. Other than that, I would give Kandahar Kanab a second chance.", "date": "2016-04-14 21:40:11"}, "36": {"review_id": "THYghP4xUygaw3RVjGyhqg", "user_id": "-bCs6n5iQ-2karqcGXCSHw", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 3.0, "useful": 1, "funny": 0, "cool": 0, "text": "I had such great things about this place and was so excited for it to open up. First time i went was in Ramadan, food was not on point at all, meat was tough and lamb were under cooked ( i chalked this up to the fact that it was iftar time and restaurant was packed) Recently we went another few times and its so disappointing because some thing or another is always missing here from the menu. Usually whatever I want to order is 'sold out' for that day. The food is okay, the staff isnt that professional either.", "date": "2015-11-25 18:22:21"}, "37": {"review_id": "0YztGEvcHTYqLMy3UOAEqA", "user_id": "uTu74kG-S_54TpMNtBC04w", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 4.0, "useful": 1, "funny": 0, "cool": 1, "text": "I have been coming here for a long time. I am just amazed by the size of the portion of food they give you like it is big enough to feed at least 3 people I usually get the Kandahar kabob they also have other delicacies such as Mintoo which is like a dumpling definetly worth the price", "date": "2018-03-28 02:41:31"}, "38": {"review_id": "TyP1Xeg6dOmjw6N0xq4MaA", "user_id": "2P1iY6SJEOirfuHpJyNUFA", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 2.0, "useful": 2, "funny": 0, "cool": 1, "text": "Waited 20 minutes and the slim waitress was rude when asked about our order. Drive for another 5 mins north and you will arrive at Bamiyan.", "date": "2016-02-03 23:52:03"}, "39": {"review_id": "-VB9uUIqJDLYmS8xFkk-Xg", "user_id": "AQY4feMQYKNZyP4GWaectQ", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "When going with a large, you want good quality food, with reasonable quantity at a decent price. Well Kandahar Kabab checks out on all three levels. Went with a party of 12 people, and we only needed to get 6 full size plates. Got a mix between Sultani Kabab and Herati Kabao and the quality and quality of food was great. It's easily possible to split a plate between two people and be satisfied. Their rice is amazing and make sure you get the bread with the dipping sauce. The price is very reasonable especially when you can share a plate between two people. The waiting time for the food is a bit longer than usual especially when it is a little busy so be prepared for that. Also, the service could use some major improvements just with the attitude of the front staff.", "date": "2015-12-28 05:21:32"}, "40": {"review_id": "V-CIe9SDeFrPZ9bamOlCSw", "user_id": "tU94-C1zpBsfGFvpsJJr2w", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 4.0, "useful": 3, "funny": 1, "cool": 0, "text": "I am not afraid to say it but I prefer the food here compared to bamiyan kabob. The portion sizes are larger and the meats are juicier, and more tender. They are literally grilled to perfection! And their yogurt and hot sauces are to die for. You will not be disappointed with the food here that's for sure. Service might be another issue. We ordered the chicken breast kabab ($8) and the signature Kandahar kabab ($15) which came with one stick of lamb and one stick of filet mignon. They were all delicious. I would definitely come back here to try the others! Everything on the plate was delicious, the rice was fragrant and flavourful and even the fresh salad provided nice contrast with all the components of the plate (smother more yogurt sauce over it!). The naan was nothing special though. The food is somewhat on the pricey side (the full meals), but is definitely worth it. It took 20 mins for our food to be called which was a tad too long for a place like this and many tables were not cleaned up with trays and food. While you are expected to put your finished trays in the carts, I expect that the tables be cleaned so patrons can sit. Plus it's just unappetizing seeing plates full of bones, rice and half eaten naan. Luckily there were many tables and seats when we went late in the afternoon. I may be nitpicking here but the lady at the cash just did not seem very friendly. But overall, I had a good enough experience with the food and the service did not detract too much from the overall experience.", "date": "2015-11-24 11:07:16"}, "41": {"review_id": "YhWq37ermLf0X5adCJYP1A", "user_id": "qIIWAMJ_LwlJi0fntUpsjg", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 3.0, "useful": 7, "funny": 1, "cool": 2, "text": "Came here to get lunch with two of my friends on New Years. The service was just okay. The girl at the cash did not seem like she knew any background knowledge of the place she works at. The menu tends to change (because it's on a screen), and she was just staring at us.. we had to tell her were waiting for the menu to come back. We asked her what the difference between two dishes are, and she just pointed to the menu.... we were like okay then. I got the breast chicken kabab and wow the portions are HUGE! We decided to dine in, so when our order number gets called, we have to go pick up our dish. Once I placed the dish infront of me I am like WOW this is a lot and smells so good! However, after trying it I realized that it was pretty bland and did not have enough flavour. I mean, it was not horrible but definitely not the best Afghan food that I have tried. They should put more flavour into their dishes. I feel like the dishes are worth the prices they charge, because it's a huge portion that also comes with a huge piece of naan (I actually loved the naan), two sauces (the white sauce is so good) and salad. They also give free water.", "date": "2018-01-03 01:49:02"}, "42": {"review_id": "lb0v94LAoROCt_6WQk4tcg", "user_id": "jcriwcTidug0fK8sgAloHA", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "I went back to this place again and it was very busy. The food took more than half an hour. The chicken breast kabob was very dry and overcooked this time and the naan tastes very stale, like it had been reheated. Not sure that I would come here often anymore.", "date": "2016-12-29 01:05:08"}, "43": {"review_id": "PuoNG2Ux7cnZum7YlV5qOA", "user_id": "-1YQDURCL6a_wuZmNXmKzw", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 5.0, "useful": 1, "funny": 0, "cool": 2, "text": "Amazing food and quality , taste is so authentic , has a prayer room too .. Wow .. My fav place in Toronto", "date": "2015-11-12 19:22:31"}, "44": {"review_id": "fHPPVyCdBmcF3aa2rjN0Eg", "user_id": "4Yp7k7YA3i07nIpLJv8kGA", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 4.0, "useful": 2, "funny": 0, "cool": 3, "text": "Amazing food! All the skewers and mains are amazing! We usually get a double kebob meal to feed two people. For about $15 we get the Herati Kebob, which comes with a chicken skewer, a kofta kebob, a ton of rice, a naan, and salad. It also comes with a white sauce that is amazing and a red one if you wanna add a little spice to your meal. Highly recommend this place if you want some great food at a cheap price.", "date": "2018-07-22 21:49:34"}, "45": {"review_id": "ibbQp8JYINhhb0itvNRYmA", "user_id": "JGf7wE44t6rQfyI1Au9tpQ", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 3.0, "useful": 0, "funny": 0, "cool": 2, "text": "The only time I come here is with my buddy MUZA he loves this place I do not know why they looks the same food is good but a bit pricy but good will still come here enjoy", "date": "2017-02-16 00:55:56"}, "46": {"review_id": "Oj2Cs-RymrAAKDmPAfrXnA", "user_id": "_Do_FsaqTv8N1p7DdGH1wA", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 2.0, "useful": 4, "funny": 1, "cool": 2, "text": "I always go here for lunch and usually get the chicken shawarma wrap. I honestly am so annoyed of their inconsistency. Sometimes the wrap itself is so hard to chew because it's hard or sometimes it's too soft and undercooked. There's only a few times it's been perfect and my coworker said the exact same thing. There's a few pics of different times you will be able to see the difference. They even put in the end of an onion. Today there was no onion or pickles, so confused! #annoyed", "date": "2018-04-10 18:04:20"}, "47": {"review_id": "tnzHFTHsjJE2dO5m1DSjDQ", "user_id": "spTV8RScH7cm2IHFxZLoSw", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "4 stars no doubt! 1 star deduction because this place needs to be better maintained. This place is busy so be ready for the wait, wait to make the order, wait for the table, wait for the food....You basically have to go and find your own seats because there is no one to seat you. You order and wait for your number to be called but be ready to struggle through the crowd of men to reach your food. Crowds also makes it very confusing to understand whether they are waiting for their food or standing in line to order. The place needs more attendants to clean the table during the busy hours. It's too much for one guy. This is often compared to Bamiyan Kabob and personally I like them both but I personally feel like the meat at Kandahar Kabab is more tender plus they take cards whereas Bamyan primarily takes cash. Also like Bamyan, this place needs better management. I feel like all the people are just standing in crowds in front of the counter to get their food (whenever that is prepared).", "date": "2017-07-13 21:20:46"}, "48": {"review_id": "IxW__7r7CKP1Ja8x_r79EA", "user_id": "1aC-GkpobzEZsoxpQHJSGg", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "Not a big fan of Afghani food but i think there chapli kabob is the best. Rest of the stuff I have tried it once and it's alright.", "date": "2017-02-16 22:32:28"}, "49": {"review_id": "AFJMcdM3z9nwK0it-pH94Q", "user_id": "333WseK_WwAgGjmstCvdtg", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "Terrible customer service, Rude staff, over charging, mixing orders, Every time I order Bolani they do not have it, so why have it in the menu? Naans are usually dry and stale and reheated the next day, No fixed time to open, last time we waited 10 minutes outside after 12 noon, Hours of business are not posted on front door. I will not go back. BTW, the above review is for their Scarborough location.", "date": "2015-08-13 04:35:03"}, "50": {"review_id": "ps_ux1K6NWkKmD3rgP4fOQ", "user_id": "_zPT9ZmR5-nUfsprzIiRew", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 3.0, "useful": 2, "funny": 1, "cool": 1, "text": "I picked up takeout here for a group at work. Only 1 person had been here before, so he did the ordering and the rest of us had no idea what we were getting ourselves into. We got Chicken Kabab, Beef Chapli Kabab, Sardari Kabab and Kabul Kabab. I'd only had Afghani food once before and it was not in kabab form, so I did not know what to expect. The chicken had a yellow colouring, making it look like curry, but it was not. It was tender, juicy with great seasoning. This was a crowd favourite. The beef chapli was INTENSE. It's a beef patty at first glance, get closer and you can see it's jam packed with spices. I had to drink some water and eat some rice to cleanse the palette before diving in again. Be ready! Only a couple people could handle it....I was not one of them. :( The other kababs looked the same, but were not. They both came with sliced chicken under the kabab. Sardari kabab was spiced lamb. I love lamb! Kabul kabab was made with beef. The seasoning was similar, just need to choose which meat you prefer. The portions were huge! All came with on giant bed of plain basmati rice plus salad. we ordered 5 meals for 6 people and 2 people had the leftovers for lunch the next day. The rice was plain, was hoping it would have had a little something to it. They have got a decent sized menu and it's all halal. If you are not sure about something, just ask. They know their stuff! It's a beautiful place, I would not mind going there for a meal now that I know what to order!", "date": "2015-11-29 19:41:53"}, "51": {"review_id": "N2x76vJKUINzanTtVi5gng", "user_id": "YE_mEEHsaOQbfgj1ymEmaA", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "Nice ambience, but comparatively I absolutely love Bamiyaan much better... These guys are also pretty good but I felt their chicken was super oily left a trail of oil on my rice .. And was not a fan of their sauce plus chicken was spicier .. Did not taste like a true afghani restaurant like Bamiyaan does.", "date": "2016-03-14 15:17:32"}, "52": {"review_id": "lT_M8lTAmFAU9PpdHYXgcQ", "user_id": "XJJ9CECWR6_gNV0L_vll8g", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "We visited on a Sunday evening. The place was busy. There was plenty of seating available. I had the vege platter. Nice to see the vegetarian option. But it had full coriander seeds and was under done. Not very pleasing to the palate. The vegan bread was sold out. The regular Afghan bread is a bit dry. The meat plates were tasty. It was a lot of food. Portions are very big. Best to order one full meal and single servings of meat if you go with a group. Dough is a salt lassi. The mast- plain yogurt was good. I have eaten at fancy Afghan restaurants and was looking for a cilantro/ mint condiment. That was missing in this place. Also the menu on the wall is very small and tough to read for older folks.", "date": "2015-08-03 12:30:09"}, "53": {"review_id": "rUVelAnt2ik9zo3bhwjUJg", "user_id": "yUQ8AppK7_UFWVN_GTgj6Q", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "We were the only people in the store when we ordered our food, then they told us their system was down. They said that they were going to call us when the food was ready and we could pay then. We waited for 20 min noticing other people were coming and leaving with their food. I approached the person who put our order through and she told me our order did not go through because we did not pay. I repeated what she had told me when we first ordered. She said \"I know I am sorry\" they should have approached us and told us that our food order did not go through while we were the only people in the store not after 4 orders came and gone. Extremely unimpressed with the professionalism and service here.", "date": "2017-10-19 17:01:02"}, "54": {"review_id": "b-ej8slsa2CdidaQZzrj3Q", "user_id": "A05HPjCOyhV9j7vn_dk7UA", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 2.0, "useful": 1, "funny": 0, "cool": 0, "text": "Gorgeous Reno of a former gym. Food took an hour to arrive. Rude front staff, food mediocre, one way exit. Stick to BAmiyan!", "date": "2015-05-04 16:46:47"}, "55": {"review_id": "MhOhd-MEuDPofXbIraz56g", "user_id": "tBaOaunEwOBT-XgeprYPKA", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "Their food is amazing. Definitely beat out Bamiyan Kabob with the Huge portions! Decor is very nice and leather booths very comfortable. Their spicy sauce is amazing, as well as their white sauce. The chicken and Kofta Kebabas are packed with flavour. You definitely want to try it out and we will definitely be coming back. Price is average $11.99 for a huge plate of chicken & kofta with rice and salad, also including their fresh bread.", "date": "2015-07-24 23:30:18"}, "56": {"review_id": "F25MOJ8b2m8vYcwtoIqqPQ", "user_id": "vyAkrxESZM9irxCXw_BvzA", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 3.0, "useful": 9, "funny": 1, "cool": 3, "text": "[LOCATION] - 5/5 Located at Finch Ave & Markham Rd. Just look for the a big, orange sign that says \"Kandahar Kabab Afghan Cuisine.\" [SERVICE] - 1/5 Disorganized self-serve style service. Customers place orders and pay for food at the cash register. Then, grab your own seat. The cashier will call-out your order number on the PA system when your food is ready. Unfortunately, the system does not work very well on a busy Saturday night. My friends and I had to stand in line, decide what to order, and also stare at people until they finish their meal so we can take their seats! We stood in line for 15 minutes, ordered our food, and waited another 45 minutes for our food. The cashier did not even inform us that the wait-time was going to be that long! [DÉCOR] - 4/5 This place is huge, but unable to accommodate the high volume of customers on a Saturday night. [FOOD QUALITY] - 4/5 Quality was pretty good overall. Chicken meat was average, but kofta (ground meat) was pretty high-quality. Salad was fresh, and rice was was infused with aromatic seasonings. [ORDER] - Sardari Kabab - $13.00: comes with chicken breast and a kofta kabab: chicken breast meat was a little dry, but paired well with the seasoning and sauces on the side. Kofta kabab was seasoned very well, soft, and juicy. Also came with a huge quantity of rice & salad. - Herati Kabab - $12.50: comes with a chicken kabab & kofta: chicken meat had the same consistency as the chicken breast meat. They used the same kofta in this platter and the Sardari Kabab. This dish also came with lots of rice and salad. I would just order this platter because it is less expensive than the one above, but the chicken meat is pretty much the same in both of them. [OVERALL] - 3/5 Overall, the platters were really good and came in large portions. I would recommend this place if you enjoy delicious Afghan food. However, you risk encountering a long line, limited seating, and a long wait before you receive your order. Good things come to those who wait, right?", "date": "2018-02-05 23:35:32"}, "57": {"review_id": "uI3mRAsnXxRr7SJRfc8LnQ", "user_id": "WzUVi46q31TaezUCGNYbVw", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "Wife and I were in the mood for kebabs about 2 weeks back (as of this writing). It was late into the evening. Still a lot of customers. First time for afgan cuisine. Price is a bit higher than we are used to however..for the portions we saw other customers chowing down on the prices seem justified. Tho the price on their single kebabs could be a tad lower, 1 stick for over $4 bux seems a bit much. We ordered take out since we wished to eat at home. Tho we found out the portioning for take out vs dine-in was very different. The chicken kebabs for us was very tasty. We also enjoyed the yogurt dill sauce that was provided. Their hot sauce had quite the kick for both of us. It had us reaching for a glass of milk (we are not really into super spicy foods/dips) to quench the flames our taste buds were experiencing. For future cravings of the kebabs we may opt to dine-in since the portioning is more. Nothing really special to comment on their salad offering..might opt out on the salad on the next visit. The only main advantage for us kebab wise, is that it is the closest one to us. Have not tried Bamiyan Kebab yet, but I have a friend who has recommended it.", "date": "2016-12-29 05:04:33"}, "58": {"review_id": "QF3Mt7VAuaEyvIdnYz_tbg", "user_id": "zLmVtQZjQ3UEYt8Cp-ilkw", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "I would not mind going back here, but I have been to better restaurants that I have felt fully comfortable and content at. The kebabs were good, and the chicken was exceptional. The decor is nice what with its fountains and chandeliers, but one thing I was not happy about whatsoever was that when I was chewing a piece of kebab, I felt something hard in my mouth. After rolling it around a bit in my mouth to see what it was, I took it out. I though it might be a tooth, a bone, or an uncooked piece of meat but it turned out to be a gold, metal, something of a screw! :O I do not know if it is a piece of the grinder, but I hope that if I do go back here, this will not happen again or to anyone else for that matter. But, I suppose the manager made up for it with how sincere he was when informed about what happened and giving us free dessert, which was delicious. All in all, this is an alright place but they better make sure to watch out for anything that may have made it into their food throughly.", "date": "2016-02-17 03:03:37"}, "59": {"review_id": "d37YOSIH3YMeCh7I60ipIg", "user_id": "UGXxwHQCIMyvbBpn-ZDNDA", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Food was great. Portions were good. Just came before 530 pm so was not that busy no lineup but lineup started after 6 pm. Filet mignon was delicious and worth a second trip.", "date": "2016-06-06 19:43:18"}, "60": {"review_id": "GHxJVHD44IslYM2vEwLAnw", "user_id": "qgWtYY2rlTtRI--7-Sp3VA", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "I ordered the chicken breast dinner with kabuli rice. Food was good overall . The chickn was tender and very flavorful. The sauces they provided to go with the meal was also wonderful. The service at this place could use a little work but overall since the meal was very good, i have to give this place 4 stars. The place could use a better speaker system. I almost burst my ear drums when the mic went of in the washroom!", "date": "2018-06-05 01:57:01"}, "61": {"review_id": "0i14g9Vw241rUFXY7hm6pA", "user_id": "OorTVYJpEhZbnf3Oh_G5lw", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "45 minutes for food at lunch hour is not acceptable....the service is much better at Bamiyan", "date": "2017-08-03 18:34:26"}, "62": {"review_id": "gZmwoM7U5pktu5hqVE8OpA", "user_id": "zfYBuh52HYzKRl84jm5pSg", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Amazing kababs! The portion sizes are fantastic! Not a very big fan of the self service style which takes away from the restaurant experience. But the food makes up for it! Usually very busy during the weekends and evenings. Great for takeout.", "date": "2017-03-26 02:56:05"}, "63": {"review_id": "kTCrDHR24KnQsx6efxY8aA", "user_id": "QqgiqJRtOflhnHNGV2J_oA", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 4.0, "useful": 2, "funny": 1, "cool": 1, "text": "I visited Kandahar Kabab about 2 months ago and I was extremely impressed with their food. The place has been on my list for about 2 years now but for some reason I have was always been a little reluctant to go when push came to shove. Likely because this is the second Afgan restaurant I have been to and my first experience was not the best. Kandahar Kabab is quite large but can become very crowded during peak hours (recommend making a reservation if you go with larger crowds). You order food at the front and they call you once it is ready, after which you can take a seat. The food does not typically take too long to cook and the portions are very generous. They also provide you free naan while you wait. I ordered the lamb chops and chicken kebabs which also came with salad and rice. The food was very delicious and I would likely take my family the next time I go. The price is decent for the amount of food that you get but I would suggest that you go with an empty stomach as it will fill you up very fast. Also, do not get too full with the Naan.", "date": "2017-01-22 18:05:26"}, "64": {"review_id": "dZCWOaWSdFgG__2bXZSCAA", "user_id": "0DVtaBKGv5uLKq7jW-0qtw", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Customer service is terrible. The cashiers are rude but the food totally makes up for this and it's what makes me keep returning for more! Amazing food, great taste and good quality meat", "date": "2017-06-14 08:02:43"}, "65": {"review_id": "cz_s80aS9jZJHiPCW57_Tw", "user_id": "wUqjjxKhm2BKz1lP7yjAEA", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Kandahar Kabab is my favourite spot for afghan cuisine in Toronto. They offer quite a variety of kababs but my favourite is the Sardari Kabab which comes with a chicken breast and kofta kabab. Almost all of the dishes are served on a bed of rice and salad along with two kinds of sauces ( one of which is a lot spicier than the other). The kababs are always juicy and tender and the portions are huge, the naan bread that comes on the side is a bonus as well. I always leave this place with a serious case of itis haha just because of how full I am after. I have been to this place numerous times and have never left disappointed I would highly recommend this to anyone I know.", "date": "2017-09-17 16:12:05"}, "66": {"review_id": "XoigLoGy9ZcwXG9iIXbBtA", "user_id": "kNnCcWHPt7D_dxtfIlxjyg", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "THE WORST CUSTOMER SERVICE:This was my favourite restaurant. From past couple of experiences I have observed the service are way below average. Today I really had worse experience I do not think I will ever want to go again. The rates which are displayed are not the same what they billed. The staff who take the order will not bother about the customer service anymore. since they are huge lineups for the food they do not need to be attentive. Today I have ordered 2 dishes 1 dish for dine in and 1 for take out and the clerk made both take out. When I asked her to make 1 dine in, just gave the parcel boxes in a tray. There were no spoons or knives to eat. They made me to wait for a while to get the cutlery. By the time I started eating the food was already very cold. I had similar kind of experience last time also. I do not think if the management is not talking care of this things soon they will lose loyal customers like me. They will not have line ups anymore.", "date": "2017-07-03 03:29:49"}, "67": {"review_id": "bCka8GAwe2sfKJbkTvFYgQ", "user_id": "IU-JcyRSCZGT1zg6FX0QsA", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 1.0, "useful": 1, "funny": 0, "cool": 0, "text": "Our warehouse is very close to this place. We order for 8 people from Kandahar kabab. They gave us the breads from yesterday we could not even eat the breads with our kababs. The money you pay is a lot and you can not even enjoy your food. Come on!!", "date": "2016-09-16 19:09:19"}, "68": {"review_id": "rUGsnEAahR8tbdCSur0uNg", "user_id": "vc7mEorcrWV04rCSQV2uWg", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 4.0, "useful": 2, "funny": 2, "cool": 1, "text": "This is a very good halal Afg restaurant, with a nice atmosphere and layout inside that includes many tables that can also accommodate a party of 30. Saw it with my own eyes. Their food is cooked to order. Everything is fresh. Freshly cooked kabob, chicken & bread/pita with salad and rice is what I get every time. Their hot sauce & white sauce is very good too. Would have gave this a 5 star if the older lady at the cash was nice & helpful.", "date": "2016-04-21 03:53:51"}, "69": {"review_id": "3zoPYBhEVNxcmeL0gFzsvQ", "user_id": "8civHNIscYSEVoTKb4M3XQ", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "First time trying this place. I have to say meat and rice are good. The salad sucks. It's just lettuce with virtually no tomatoes and like 1 sliver of an onion if that. Worst thing about this place is the service SUCKS. I ordered take out and had to wait 48 mins till I got my food. The ladies at the front are lost and have no idea what is going on. Food is good but not worth waiting 48 mins for take out while standing. I will not return.", "date": "2017-07-14 17:38:41"}, "70": {"review_id": "m_DU7W2FYMFNGvgWgORksw", "user_id": "LxIrUthRLgWD39M9G0OJXA", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": ": I want to Kandahar kabab what I nice rest. Super service nice food great to go whit family friends", "date": "2015-07-29 05:29:53"}, "71": {"review_id": "-CrD0eOZaEEeqmKTMdNo4g", "user_id": "0gyVAgHtuXYMp3hRIoD7cg", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Food is amazing.. mouth watering even thinking about it. Best afghan food in scarborough.. will definitely recommend it to my friends.", "date": "2016-10-12 21:25:02"}, "72": {"review_id": "GAYHw94-nRfH4IpscPq0ZA", "user_id": "Mulxiw2y9YS9tDoHP2gDMw", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "Came here with my colleagues for the first time and I must say I am impressed. First impression of the place is not too bad. Looks clean and had some nice waterfall glass decor. The meals are made fresh and was pretty quick. I went around noon so it was not too busy. I ordered the lamb chops and they were super tasty! Some parts were a little burnt resulting in it being overcooked.. Overall was a good experience.", "date": "2016-12-31 01:28:55"}, "73": {"review_id": "SaYQYwlK1HOPUclDbxfm6g", "user_id": "ikwEfq5tjJmc911YkrzKPw", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "this has to be the best afghan food in scarborough/markham. they are pricey and are super busy , but if you catch them at a good time their food is great. ive eaten at other places but this place honestly serves way more food and it tastes way better. their white based mayo/ranch sauce is DELICIOUS. though i would say their food is pricey and they do need to expand their front desk to serve more people. considering the restaurant itself is pretty large, they should have more cashier stations. i get the boldak kebab which always tastes great !", "date": "2018-05-16 18:59:48"}, "74": {"review_id": "iKopO3N6cxPjJEmpBjGeUw", "user_id": "0HuRMxh_x8snXcKu6RYDMw", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 3.0, "useful": 0, "funny": 1, "cool": 0, "text": "Nice place. One of those pay first and wait in line for your number to be called to pickup your order and take it to the table. Nice and clean inside and out. Good potions I actually could not fully finish my meal though it was decent food. Would require a second trip to this place to fully review the dish.", "date": "2015-12-13 16:44:41"}, "75": {"review_id": "5odajqzCHXQf1j2OGe5aAw", "user_id": "RRhco4irDXPk5EJmvuwr2w", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Good food. Good decorated restaurant. Prices are pretty fair. The only thing I dint like was their souce and naan bread", "date": "2015-09-06 20:02:57"}, "76": {"review_id": "qffhux17SKea3xtnmzMt_g", "user_id": "pqrLANAdicCfsD_Hrdy4Xw", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "I got the usual Kabob but tried fish from my mother wish I has ordered that! Very busy location. But serves typical afghani food. I think Mentu were ok, I have had better!", "date": "2018-08-23 17:29:59"}, "77": {"review_id": "pYd2ZvHChNhdNem9tNwZGQ", "user_id": "S3h-0vC4OwyahD0idAIdRQ", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 4.0, "useful": 1, "funny": 0, "cool": 1, "text": "My go to Afghan place!! If you have any doubts about going, trust me you should go! It beats bamiyan by far in my opinion. My favourite is the herati kebab with extra white sauce (make sure you ask for it, cause they are pretty stingy) The skewers are cooked to perfection and the sauces make the entire meal. The portions are also outrageous and can be shared between two people, unless you are like me and can devour the whole thing. The only problem that I can think of is the service as it can take a while to get your food ready. There's been multiple times where I have called ahead to order and by the time I get there (around 20 minutes) it's still not done. But it's not that much of a problem as the food will be all worth the wait :)", "date": "2017-12-12 23:10:56"}, "78": {"review_id": "mI8fKi7WdJeNlyrBw2Rs7Q", "user_id": "XpIhjnYocvFi-Q7ZISqsQw", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "This is the best Afghani restaurant. The chicken kebab and the kofta are amazing. The rice and the garlic white sauce and red hot sauce they give you is so delicious. Everything you ordered from this place is fantastic. You will not be disappointed at this restaurant. The location is not the best but the food makes up for it.", "date": "2018-05-08 01:31:45"}, "79": {"review_id": "DFvDXwN5GDCHyH0wHphXrg", "user_id": "xQc-wN-Ni7owm2zBBlrU3g", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Very delicious food with good portions. Their chicken and beef kabobs are worth going back for. There are no waiters though which is a bit odd. Still very good food at a fair price.", "date": "2015-08-14 20:02:20"}, "80": {"review_id": "wsTRABTwr1eALgSsVgGJIQ", "user_id": "IiNXmi21gC5us_K2zxsoMQ", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 1.0, "useful": 1, "funny": 2, "cool": 0, "text": "35 minutes and counting for chicken breast and kofta and on top of that, my order was processed as completed and I had to go up and ask about my order. If it was a busy day I can understand. But it's not and this is not acceptable. And after I asked where my order was they did not even apologize for their screw up. Excellent service :/", "date": "2016-01-10 23:20:30"}, "81": {"review_id": "PDISg6EhGzJssTXQVp51vw", "user_id": "zA0mrEC_LxmYH-1Kkt3JFw", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "This place has the most tender veal filet mignon I have ever had. Their chicken and beef kofta is extremely flavourful and moist. Also, this place has the best naan I have had. I could eat it forever. The lineups and organization of the place make no sense to me and it can take a ridiculously long time to get your food during peak hours but the wait is totally worth it for the meat!", "date": "2016-12-29 21:51:24"}, "82": {"review_id": "bsVKrc9DUgAzj4jgRsEdpA", "user_id": "qBwHmwKoJPr_Mhrov4hbXw", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "At Kandahar Kabab, you place your order, seat yourself, and wait for them to call your number. The dishes are huge and can easily feed two people with heaps of rice, meat, and salad. The orange sauce is spicy and delicious. The restaurant is big and airy so there was lots of space to sit on a weekday evening. I would not really come here for the ambience, but the food is great!", "date": "2018-08-20 12:25:50"}, "83": {"review_id": "L26hHLEvYewh9kMnlBKN3A", "user_id": "HmAX8INf8yz0o6JvqFcV8g", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "I have given this place a couple of tries and although the food is good. The service is quite slow and have witnessed the cashier/waitress get in arguments with customers over items that could easily be rectified. I will be driving the extra 5 mins and go to Bamiyan instead.", "date": "2016-03-04 18:41:47"}, "84": {"review_id": "2InCj-OqmX6GT6SYVgKHgQ", "user_id": "oh1fjlTS8zDDi2GikjtO_w", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 5.0, "useful": 0, "funny": 0, "cool": 1, "text": "Me and my family had first gone to another restaurant but we went a little too close to closing time. The staff there was extremely rude and gave us a lot of attitude. Much to our benefit, we ended up coming to this place instead. The restaurant was very busy and as soon as we went to order, the man at the counter informed us that they had run out of bread but in return, they would give us free drinks with each of our meals. I ordered a pistachio milkshake thinking that would also be free but actually the soft drinks were free. However, they still gave us a $3.00 discount on the milkshake! Which was very tasty by the way. The food was very flavourful and delicious. I especially loved the yogurt sauce that came with our plates. The decor in the restaurant was also beautiful. Furthermore, after such a bad experience being yelled at at another restaurant for going in too close to closing time, it was refreshing to see all the (young) staff here were so friendly and polite. It's definitely a place I recommend and a place that I would go again. Wonderful customer service.", "date": "2015-07-23 10:27:28"}, "85": {"review_id": "4i6hYyz8ASdEO6RHkBIQ7g", "user_id": "_a-EnhK4wrjMLfz7loD0Xw", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "The food is very good, I prefer the overall flavour over Bamiyan Kabab. They do not wait on you, you just wait for your order number to be called and go find a seat. Their white sauce that comes with the salad is yummy, I always get extra. Also I would not recommend the mango drinks, it just tastes like watered down mango syrup from a can.", "date": "2017-06-26 21:39:32"}, "86": {"review_id": "LE-oSK8RzdQJgZeKmAQYHg", "user_id": "XY3wthJeOJfYbGmg2scwEw", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "You have to order in the counter and they will give you a number. Be patient service is slow. Food is ok in affordable price. They do not have enough staff to clean the tables.", "date": "2018-10-17 23:20:32"}, "87": {"review_id": "b9aQW_QcIwkad5O6QVdK9w", "user_id": "W7d_FtVteE162r4BrrKeTA", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "I really love this place...haha when I was pregnant I started craving afghan kebab...we went at 10pm and the place was popping! So many families and groups of people grabbing food, while we were in line, one couple told us this is the best place for kebabs and better than Bamiyan kebab and Naan and Kebab. The food was made to order, plentiful and tasty. The decor is pretty nice for a self seating/self service type establishment. I recommend the tandoori chicken and the beef kebab..yum!", "date": "2018-10-14 17:08:52"}, "88": {"review_id": "c7EvaZAA7-dHU3gR1VegWA", "user_id": "DStRnaP_nZbGBEOCNddRDQ", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "My family & I often visit this restaurant. It's usually very busy in the evenings & around 'desi' dinner time. Although the restaurant is big, seating can be a nightmare! The few times I have visited in the day, we found seating easily. However, at night you may have to wait for a long time standing around, eyeing diners who are almost finished to 'conquer' their table after. Finding a table along with other families also 'hunting' is like a flock of birds scavenging - 1st to fly over & sit has won. Sometimes families that are almost done are nice enough to let you know ahead of time. There is no reservation system from what I have experienced, no hostess to seat you either. You walk in, order, find a table or vice versa if you are dining in. I wish they would have a reservation system or hostess at least, it'd make it less chaotic. This chaos really brings out how polite fellow diners can be or show their lack of manners i.e. glaring looks, body shuffles to move you out of path to a table, dirty tables. I do not advise going their for dinner during special Islamic holidays or Ramadan, it's war people! It can be very noisy, with large families, young children & sometimes crying babies. I have seen young kids running around, tripping & bumping their heads, crying when it's busy - the parents do nothing & the staff do not say anything. Parking can be a similar nightmare. The cleanliness of customers versus the staff are different. The decor is nice compared to other Halal restaurants. The entrance & cash area have a nice glass water fall thing & some chandeliers. The benches & chairs are a leather look with marble like tables. The place is spacious - with the few staff that are at the front (usually 4-5), they do their best to clean the tables after customers have left their dirty trays or demolished an area with rice scattered everywhere & on the seats. When it's busy, tables do not get cleaned right away, so you might have to find a staff to clean it, once you have asked a member of your party to hold the table. Some customers, including myself, do take our empty plate & trays to the drop-off station. The staff can be friendly sometimes & sometimes like zombies. There is Afghani music playing in the background. There is a separate Wudu/Prayer area. To order food, line up at the cash & order off the menu. We usually order the chicken kofta kabobs with rice or the chapli kabobs. I preferred how they cut their salad when they first opened in Scarborough, I do not like the new style, it's cut very small & hard to fork. The salad is an average salad consisting of lettuce, tomatoes, cucumbers & onions. The meat is very flavourful & tender. Sometimes, on busy days, they run out of a specific meat by the end of the evening - so they will say no chicken, etc. Their rice is long grain & non-sticky. Their sauces are a big hit, I love the hot sauce especially. They serve Afghani bread with a white sauce to start. I usually skip the bread as it fills you up already & I can not finish my main meal. Prices are usually in the $11 mark per main dish. I like their mango drinks & yogurt drinks. Once you pay, your receipt has the order number & they call your number once your food is ready. The portions are great, fills you up well.", "date": "2017-03-18 15:27:58"}, "89": {"review_id": "aDBgQWoq0ZNrkD6CyZgRcg", "user_id": "PewnkMbzleX0ouGC24gSew", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "This place is disorganized. I came with family. Half the items on the menu are not available. They seem to have run out of the Chapli Kabab. No Boulanie. No kabli plow. Etc. Etc. I would not recommend this place and will not be coming back. Slim pickings on the menu. No accommodations. No apologies. And when we did order we waited 30 mins for the food. And then there was a big disgusting hair in my plate. Do not eat here. Go to another Afghan restaurant.", "date": "2017-10-29 19:51:56"}, "90": {"review_id": "9ToNu7Sk1CBWKEsUfFo8oQ", "user_id": "mp9oO_C_o512UXaOCbFf3g", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "The food was so good. Huge portions which I need two days to finish. The rice was yum! And I am not even a huge rice fan. Its casual dining with modern ambiance. Price was reasonable as well. Will definitely be back.", "date": "2016-08-02 03:55:40"}, "91": {"review_id": "kYe2Et5z3gGVQ0rU4L-spQ", "user_id": "Jq_fwNUE0wE1AwN1vk6Aqg", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "We were in Canada for 4 days in May and OMG...this was the BEST BEST lamb tika kabob we ever had. The lamb was very tender and rich in flavors, it was not over marinaded...it was just perfect!!  The palow (brown rice) that came with the kabob was also delicious and very flavorful. My brother and I are specifically going to Toronto again next month because of the place :) Atmosphere is like a fast food place, loud and self service but the food is amazing and makes up for it. I have been recommending this place to everyone thats going to Toronto!!", "date": "2017-08-26 23:06:42"}, "92": {"review_id": "HykJLnZm2BiGB8nZZsRwfQ", "user_id": "hf9v4vRuN2S8_GxNhu9W7g", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 1.0, "useful": 0, "funny": 0, "cool": 0, "text": "Waited over an hour for our food. There was no organization, people crowded around the counters so you could not even get through to get ur food when it was finally ready. The worst part though was the service. One of the servers was incredibly rude and actually started yelling at us because we could not get through to pick up the order. The food was good but not worth being treated like shit.", "date": "2017-05-21 22:17:53"}, "93": {"review_id": "IVnGdkdDH6OTJSe7N3yJPw", "user_id": "c2y6BT6X3XEnoOaxcFeSdA", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Authentic Afghan food. Portion sizes are very big so order wisely. One platter can serve 2-3 normal people.", "date": "2018-04-25 05:06:01"}, "94": {"review_id": "qFIhg1_9R7Cv_A4dTJZDCA", "user_id": "WFUxFWa5FAj_89qj46OAHg", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 4.0, "useful": 1, "funny": 0, "cool": 1, "text": "When I am craving Afghani food, this is my place to go. I find the portions and price the same as the more popular Bamiyan Kabob, but the flavours and taste at Kandahar are far superior. I always order the Kandahar Kofta Kabob platter that comes with filet mignon and ground beef skewered and grilled. The platter comes with salad, rice and naan. This platter is more food than an average person can eat and I always bring home leftovers. There is so much fragrant rice on the platter that is spills over onto the tray. The salad is a bit plain but tastes great with the tangy white sauce. The hot sauce that they serve is not too hot but tastes very good. The naan is crispy and tasty and does not taste like a brick like the ones at Bamiyan. The best part are the meats which always come out juicy, so flavourful and extremely tender.", "date": "2018-01-20 22:01:32"}, "95": {"review_id": "nbi7PTf9j9jgSPzJH5ImPQ", "user_id": "EFddU8cj_WTKTBFgdatFBA", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "Food is tasty. Service is beyond hopeless. Cashiers are friendly but counter staff is pretty un-aware of wait times or what is or is not currently available. They are not familiar with service industries standards. Arrogant and obnoxious counter staff.  Cashiers are polite but the manager behind the counter does not belong there.  Restaurant is nicely made, they need a host/hostess out front to manage the incoming guests as it does get busy as any halal restaurant in the area. Another halal restaurant offering halal food but below standard service", "date": "2017-05-15 02:07:21"}, "96": {"review_id": "XAjSgbosivCmkK_Iz5OOXw", "user_id": "8UQVqPr-EQPAEussmeBCXw", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "Very nice interior. Lots of seating. Went on a Sunday evening yand was really busy yet only had one cash open which was weird. Got the herati Kebob with one chicken Kebob and one beef kofta Kebob. Took about 30 minutes to be ready. As a regular bamiyan customer I will compare the two. Bamiyan wins hands down. The chicken was over cooked and te rice was too dry. Even the bread was not as fresh. Overall good experience but with bamiyan only a 10 min drive north I'd rather drive over for far superior food.", "date": "2015-06-08 16:08:12"}, "97": {"review_id": "AW9O-Mr_uVUKMy8ucOV2YQ", "user_id": "2_J91lZzqXOYyYeNcVd2YQ", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 4.0, "useful": 0, "funny": 0, "cool": 1, "text": "The food here is amazing and comes in huge portions. I personally do not enjoy the pita and salad (especially the salad) that comes with the meal so I ask for extra rice as a replacement instead. One meal is good enough for two people. Definitely ask for extra sauce, tastes better with it. This place is kind of food court style where you order your food, get it and sit down and eat. There are no servers so you do not have to tip if you do not want to. All in all, great place for kabobs and rice! Definitely recommend - extremely affordable!", "date": "2018-02-21 23:46:01"}, "98": {"review_id": "hfl1TNDFCHB12Pa3WrHxBw", "user_id": "fmZFlp-5edFQuwkhtlsDkg", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Good food , reasonable price ! Portions are big and Come with Side . I love the freshly baked Bread . We tried 3 different types of Kabab and All was delicious.", "date": "2018-10-29 14:51:32"}, "99": {"review_id": "sITVFFc-RHepR2UVGDLQVw", "user_id": "qzBBJJ0Fa70IZb27jCCo5g", "business_id": "Jcyu0ml7rxizEA8giSH-8A", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Great meals at reasonable prices. Just gets very busy on weekends, huge wait and over crowded.", "date": "2016-09-04 19:21:58"}}