{"0": {"review_id": "yrUEXpfaAUmr1a8nlpRfMg", "user_id": "nviApoP-lawwz-M_2bCyXQ", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "I am so glad they opened one up here in AZ. Every time I go to California I would always stop by Bambu. I love the fact that this place is located in the Lee Lee plaza I can get all my shopping done conveniently and enjoy a che drink or even dessert. The place looks great inside modern and clean. The staff here was very helpful and more importantly the product here delivered I could not tell the difference from this location and any of the ones in California other than when I walk out of the door I could feel that AZ heat I will be returning to try some of the other dessert and drinks they have!", "date": "2016-06-11 21:08:32"}, "1": {"review_id": "rtNmG--e-4mpzLTm2uAiRg", "user_id": "GDGm2JWYnxJs-qyvA0twuQ", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 4.0, "useful": 3, "funny": 1, "cool": 1, "text": "As a Bay Area transplant, it was nice to see a familiar face like Bambu in the boba-deficient land that is Arizona! I am not a huge fan of the Che drinks (I prefer my toppings to take up less than 50% of my drink) so my go-to is usually the black milk tea or the jasmine green milk tea. My favorite part of Bambu is that they have crystal boba, which is a crunchier seaweed-based alternative to traditional tapioca-based boba :) Quality is comparable to my experiences at the Sunnyvale and San Jose CA locations, but this place is SUUUUUPER heavy handed on the ice! The past 3 times I have gone and asked for less ice, they have still loaded my drink up with what feels like a default amount. I get the heat is RIDIC outside but still... Overall, I have come back repeatedly and would return for their reliable drink quality!", "date": "2017-07-28 23:57:11"}, "2": {"review_id": "l5GVkiwiy_O7v2B0jIdx8Q", "user_id": "ORJ0z6-tC5lX-nt16OrHHg", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 4.0, "useful": 1, "funny": 1, "cool": 1, "text": "Ahhhhh, I love this so much! When I was younger, my mom would make homemade \"Che\" (Vietnamese sweet dessert) all the time, but now she's too tired and busy to make any. Not homemade like my mom's, but still delicious. This totally hits the spot after eating lunch/dinner. Very refreshing and light. I got the #6 and it was perfect on sweetness level, and had different factors of taste and texture. From jackfruits, longan, and coconut flesh, to red tapioca, pandan jelly, and more. All these complement each other and was not too sweet or overbearing. The service was great. I hope one day there will be one in Tucson! But I will for sure always stop by Bambu when I am in the area!", "date": "2016-07-03 23:41:49"}, "3": {"review_id": "u0nPLmGwFeBAFvv7UyWvIA", "user_id": "3R_dB9VQ_D3WPJEw7pmorA", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 3.0, "useful": 3, "funny": 0, "cool": 1, "text": "Nice Service, But Not Impressed By My Drink Here..... The girl at the counter a few weeks ago when I visited here was really friendly and did her part well. I cannot complain at all about the service and the atmosphere of the business was nice and clean as well. I specially like all the pictures of things on the wall which help someone like me make a choice by seeing that it looks tasty and expecting that it will actually be tasty as well. I saw a bunch of my yelp friends have really enjoyed this place and frequent it often. We thought we would stop in for a little treat and I do not remember the thing that I ordered anymore since it's been a few weeks but I definitely was not impressed with my treat. I was a bit disappointed that there was not much flavor or anything going on with my drink. When you go to get a treat you expect some sort of treatishly goodness to excite your mouth. All I got was a drink that did not really taste like too much and left me wondering why I had bothered get it. I feel bad giving them only three stars but out of five stars that three stars was for the service and clean environment. The treat just really did not do anything and was a disappointment.", "date": "2017-11-07 00:05:27"}, "4": {"review_id": "xiZv67YhmpC_YTJNRWvLAg", "user_id": "jota0sSnaRVO-pyr1IM5IA", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "I was so excited that my favorite Vietnamese che place from CA opened in AZ. We were the only ones there that day and location is rather hidden in the plaza. The ones in CA are always packed so that was a surprise. It's great that they have a large picture menu wall showcasing all their creative colorful che combinations. I ordered the Red Bean Combo (red bean, taro, pandan jelly, coconut milk). Unfortunately, it was waaay too sweet for my taste and I have a pretty sweet tooth. There was even a table with bottles of syrup for if you wanted to make your drink EVEN sweeter. I think the drink would be as good as the ones I have had in CA as long as I request less sweet next time. Will give it another try.", "date": "2017-10-11 03:01:00"}, "5": {"review_id": "u0Tx2Jd89NkNxzgDn4ZVvQ", "user_id": "iDlkZO2iILS8Jwfdy7DP9A", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 3.0, "useful": 8, "funny": 1, "cool": 3, "text": "My friends have been raving about Bambu from Cali trips. Then they heard one was opening in AZ. And they have been here a few times. But then I hear about the place having a smell due to the dog grooming next door. I came here on a Saturday night but I did not smell anything unusual but then again I have three dogs. LOL! The staff was extremely friendly and super awesome to explain the drinks. I got the blended Thai tea with boba. It was a lot sweeter than I like. All the other drinks look good. I will ask for 1/2 sweetened next time.", "date": "2016-06-23 02:22:26"}, "6": {"review_id": "W7FdGa88UHTuDHakv5PKqg", "user_id": "3PgiO3mMAMfbP5Qs7L2New", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 5.0, "useful": 2, "funny": 2, "cool": 1, "text": "Super bomb!!!! Great addition to the Asian part of Arizona. LOL. Watch out boba tea house you have got neighbors down the plaza!", "date": "2016-05-31 22:09:54"}, "7": {"review_id": "CFiQOAAOsTgAhqmMn_VZNA", "user_id": "3-urYQ6uYM1nk1sviHXaJA", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 4.0, "useful": 1, "funny": 0, "cool": 1, "text": "Great service and cute little spot. 4 star because the drinks were not that good... we end up throwing both away after leaving. The pandan waffle was delicious, I'd probably go back for that again.", "date": "2017-08-29 21:41:35"}, "8": {"review_id": "MSqLXzUbjGPyMafehF72iA", "user_id": "en6RMLyud2_VCVHpeXsmyQ", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 4.0, "useful": 10, "funny": 6, "cool": 10, "text": "I do not get what all the stink is about... I have been hearing rumors about this place having an off smell due to the dog grooming place next door, but none was experienced during my visit. Apparently they have got it under control now, so if you have been avoiding visiting due to this, it seems no longer an issue. I was quite full by the time I rolled in, but wanted something cold and sweet to finish the night. I had heard good things about this place from fellow yelpers, and saw a post for a red bean drink and knew I had to have it. I have not had red bean in a drink since MITEA in SD, so I was quite happy to try the one here, and I may even prefer this one. They definitely do not skimp on the red beans, and it was well balanced and not too sweet. They are located a couple doors down from Lee Lee supermarket, so if your looking for something refreshing after shopping, bambu would be an excellent choice.", "date": "2016-06-13 04:35:14"}, "9": {"review_id": "HjWgPKcKoTMUu76OD5gapg", "user_id": "n8sxD3ybFwCHhOo9P3bVhw", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 3.0, "useful": 1, "funny": 1, "cool": 0, "text": "I had to post a review about my experience today. I go here often because I love how fresh their drinks are, however, this experience was not so pleasant. I found/drank two hairs in my boba drink!!! How disgusting and disappointed. This has never happened to me before at this place. There was a different girl who did make our drinks so probably that made a difference? C amon now, please, while you make our drinks wrap your hairs up in a net not just a beanie or a cap. I am very disgusted by today's experience and will probably have to stray away from this place for awhile. I URGENTLY ask for your staff to wear some sort of hair nets while making people's drink because you will find unhappy customers, whom are your frequent shoppers. Very disappointed today. I had to rate this place a 3, unfortunately.", "date": "2016-11-23 04:19:12"}, "10": {"review_id": "PHOchU7-qvVC5vv-pwQZRA", "user_id": "wCf6kyE9Mx3y2dPX0HUgQQ", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Discovered this place online to try out some new boba places and I am ecstatic that I got to try them today! I ordered a soursop smoothie which was delicious. I was very excited to find soursop as an option because I have not had it since I visited Florida. The lady at the counter who's name I did not get was very friendly and welcoming. She told what the shops specials were and was very helpful. I for sure will be coming back.", "date": "2017-10-02 22:47:09"}, "11": {"review_id": "EtygI6rVfM1h0d4P-57e1w", "user_id": "yapi5KhO5_333W6szugjYg", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Is very unique in the area. Drinks have Asian flavors, but appeal to a broader audience... sweet enough, fresh, etc. Much of the traffic was walk in, order, go. They have seats and wifi, cozy enough to stay a bit, do some reading, etc.", "date": "2017-01-16 19:33:09"}, "12": {"review_id": "cNN-z5woccL_L4Or64GSAg", "user_id": "CruXS1miugUWBGqv66Z1Jg", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "I first tried Bambu and was glad it opened a location in Chandler as a crave desserts such as Che Ba Mau and Bo Dam from time to time. I love that the desserts are not overly sweet and you have the option to add simple syrup to your taste. Generous portions, but a bit on the pricey side.", "date": "2016-08-26 10:01:32"}, "13": {"review_id": "ykkAlo-oDFFyuPi3Sk0OVA", "user_id": "r4mG4fdwOVayKotK3lULvA", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "came by this place randomly and was very pleased with my dessert! a whole bunch of matcha goodness! will be back !", "date": "2017-12-05 01:32:09"}, "14": {"review_id": "xuv_Dgb3gYo1gMLZuV2rAg", "user_id": "OgSVGErgR0CmA61h8s1NnA", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 3.0, "useful": 1, "funny": 0, "cool": 0, "text": "I had their che (green tapioca with black jelly and coconut milk) and it's no where close to a Vietnamese che, their coconut shake was average.. The service was good, the lady was very nice and sweet..", "date": "2018-04-16 08:39:16"}, "15": {"review_id": "gSxMNvMwpsnTxtHj_VB0fg", "user_id": "uQ8n0xWLk-heB9D4NmqQgA", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 3.0, "useful": 2, "funny": 0, "cool": 2, "text": "I have been here several times, and I really like the concept of all the Che they offer but I am also extremely disappointment by the flavor. One one hand, they serve all my favorite Vietnamese desserts. On the other hand, it tastes extremely watered down, not authentic, and for a hefty price relative to usual prices of Vietnamese desserts. One portion size is sizeable and could be shared among two people. The boba drink is pretty on par with other places, but I think their boba is above average. It's extremely sweet and soft!", "date": "2017-06-19 03:46:40"}, "16": {"review_id": "owBp2nzpQeM1oIn5Llz_3g", "user_id": "bQSZne0uDIVuChRtK_gchw", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 2.0, "useful": 1, "funny": 0, "cool": 0, "text": "Very disappointed... I have been here quite a few times and today my drink does not taste like it usually does. I ordered the number 11, which should be made from real coconut juice, but today it tasted like water with added sweetener: $6 for water with jelly and fruit is a little overpriced in my book. When I visit a place of business that serves food and drinks, I depend on them to be consistent. So this is a big no no to me. I probably will not be back for a while.", "date": "2016-10-14 20:20:33"}, "17": {"review_id": "eloJ7Ux_OTa8hYPF1TucXg", "user_id": "j_j4DLfvNkhCRNWC0VBS9g", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 5.0, "useful": 3, "funny": 1, "cool": 4, "text": "If you are looking for delicious dessert drinks in the area, this is the place to be. I have not had any drink that I did not like. My favorite is any of them that has coconut, taco or red beans in it. If you are adventurous, you can also try Durian smoothies. If you do not want to try anything crazy, they also have ice coffee. I highly recommend this place to anyone who wants to try something new.", "date": "2017-01-29 22:32:12"}, "18": {"review_id": "eO4em3mQf1vx4LSZQ9Bi5Q", "user_id": "EtYkBlkXX0SY3Il5kAPvtw", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 2.0, "useful": 1, "funny": 0, "cool": 1, "text": "I feel bad giving Bambu a low review because I love their concept and am usually a huge fan of Asian drinks but we ordered three different types of their most popular drinks (added up to $17) and we could not finish a single one. The woman who served us was the sweetest and deserves a raise for her enthusiasm though. However the drinks themselves were too sweet and really difficult to drink. Our straws all got clogged with the pandan jelly and had to be thrown away", "date": "2017-07-19 14:38:42"}, "19": {"review_id": "U1J0n4pmHeVvGcGxE79e3A", "user_id": "PHtPhrcM6ScMzHXoVzhtvw", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I found my new spot... I ordered the Vietnamese coffee blended. Delicious and delivered a big kick!! Service was super friendly and the place is immaculate.", "date": "2016-06-02 17:46:48"}, "20": {"review_id": "ebzqRdX7IMvmajq0oRUvQw", "user_id": "ZoaLoMpFL3PnaXes-TMmUg", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Awesome Chè and Vietnamese coffee drinks! Fruit Addict is a must try and even better it's dairy free! Love the fresh coconut and lychee in it. Service is super friendly and very clean!", "date": "2016-06-02 03:44:19"}, "21": {"review_id": "gtpirxNJeXCTnwwhESnaIA", "user_id": "zwmw_cNa5DzJotaFOHTvQg", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 5.0, "useful": 1, "funny": 0, "cool": 1, "text": "Have not had a food crush like this in a long time. Came here last night and again today. Loved the Che #1 ordered it without added sugar and the fresh coconut juice had enough sugar for me. Just asked them to come to Tatum and Shea area but not sure that will happen! Happy drinking fellow Yelpers!", "date": "2017-03-05 18:35:02"}, "22": {"review_id": "dwM5cUGpMgew2-A1H3OXcQ", "user_id": "8oml7qh4oTsted_TNMzH6A", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 3.0, "useful": 1, "funny": 0, "cool": 0, "text": "I visited yesterday afternoon and found the interior to be beautifully decorated. I am not sure if they were employed there, but a woman greeted me at the door. The woman behind the counter was also friendly and had good customer service. What makes me dock two stars is what I received. I ordered the Bamb? Special. Not bad, but it was not anything spectacular or out of this world. The second item I ordered was the black milk tea. Someone with me ordered the French vanilla iced coffee. I really liked the creamy flavor of the black milk tea, but we were disappointed that one small cup cost approximately $4.75. On top of that, there is 75% ice in the cup and 25% liquid. I might return again the next time I visit Lee Lee's and try the other chè they have to offer, but will probably never order their teas or coffee again.", "date": "2016-06-13 05:01:50"}, "23": {"review_id": "ZJKk0solcBqUD4vW2jqkeQ", "user_id": "J-ZMQMjMhoJ6oTDZ_Y-MNw", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 4.0, "useful": 5, "funny": 2, "cool": 5, "text": "Was extremely excited about Bambu coming to AZ from my hometown San Jose! I was anticipating the opening ever since seeing the Bambu car at Chandler Fashion Mall Bambu has fruit smoothies, vietnamese coffee, boba and the vietnamese dessert che. I Loovve the coconut milk and three beans and jellies! It's like colorful, squishy gummies with different textures on top of crushed iced and creamy coconut milk. Yummmm..   We ordered the #6 fruit addict it was hard to decide what to get. I liked that it came with pieces of real coconut and jackfruit, lychee and red tapioca. I wish it had more beans and coconut milk there was so much jellies that there was very little coconut milk. Price wise felt a little higher than usual $5 but because the place was clean and they accept credit card!( They do not charge minimums like most asians places) I think l will let it slide. Next time I will customize my che you can choose inredients as you please. *Do not need to order the preset combos. Hurray hope bambu is here to stay! PS. please bring loyalty cards ! ;)", "date": "2016-06-13 08:03:15"}, "24": {"review_id": "sSA37EarkQxRfWdmQ3zhRA", "user_id": "gx0a4I8IK6kYh_Ej83tkYA", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Very nice people ! Helpful in choosing drink /dessert! I if you are expecting Boba it's definitely different! I was full off the size ! It is a bit pricey , mine was comparable to a grande at Starbucks and it was 6.22, I did tip to 7.00 ... I had to get it out of my system and try it ! I will probably go back to try the fruit addict !", "date": "2018-04-16 20:13:59"}, "25": {"review_id": "W6zrmchS9C3oDKTtQNt8xw", "user_id": "5nN0-wZCgUskF80UZ7L0Eg", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 3.0, "useful": 1, "funny": 0, "cool": 0, "text": "Nice store and friendly staff but the drink was way over sweetened. I went because I used to go to the same store in San Jose, Cali but this location in Chandler does not have the same drinks I used to have.", "date": "2016-07-27 19:24:53"}, "26": {"review_id": "klyFFNp-ObWCfP58b-wViA", "user_id": "VA1oFXMd2VCkRmK_x_lEsg", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Pricey but the ingredients are unmatched. I do not mind paying more for something I am VERY happy with. The young employees need to work on customer service skills but that's ok. The end product has no comparison. Thank you BAMBU.", "date": "2017-01-17 23:40:55"}, "27": {"review_id": "Y6XTtgR2l8kqqxN-201-Jw", "user_id": "UA7eCROEYywPrDQDopNDGA", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 5.0, "useful": 0, "funny": 0, "cool": 1, "text": "I arrived at closing time. They were happy to make me an avacado smoothie. It was creamy smooth and delicious !! Kimmie and Lee were super nice and told us about the Avacoffee and Che.  I will be back soon !!", "date": "2016-10-02 04:27:34"}, "28": {"review_id": "BPfJRlLM0_EhHQIeLqsG6w", "user_id": "ZFJ74aq65K0ReL5zZqzfig", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "A little bit over priced desert for the majority of canned food fruits... but hey I guess someone's gotta pay for the AC and sitting area... BUT this is an in and out kinda place... not really a hang out spot, so I do not see the price is just... does not make sense. But desert is still good", "date": "2017-03-28 23:14:21"}, "29": {"review_id": "E7cTwSu9ctzemJrNwshISg", "user_id": "-VPbztwxZfQOnL6gar8Fvw", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 3.0, "useful": 2, "funny": 0, "cool": 0, "text": "I found Bambu on Yelp when I was looking for a smoothie to tide me over until lunch. I wanted simple strawberry and banana and mostly fruit. Unfortunately, what I got at Bambu was more like a milkshake with very little strawberries and bananas in it. The flavor was OK, just very weak. It tasted more like vanilla ice cream than anything. Also, it was expensive for a small. Finally, at the time, I was the only one in the store, and it still took quite some time to make my smoothie. I felt like the quality of the yogurt or the ice cream or whatever they used was high-quality, if you are looking for something for your kid that is more like a milkshake, then this would be the place to go. However, I wanted a healthy smoothie that was mostly fruit, so I would probably not go back.", "date": "2017-05-03 15:58:02"}, "30": {"review_id": "ss-dKcGv1cbplrnFIRJNDw", "user_id": "OugUvRaU_uUMOfJWNwk_0w", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "The atmosphere was really relaxed and the drink I ordered was amazing. I am definitely going back again.", "date": "2016-06-25 02:11:55"}, "31": {"review_id": "3qkL1XezqOPX6HBM8I0qZQ", "user_id": "2thnwbpnh9A52OW45xmopA", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Stopped in here while doing some shopping at Lee Lee's. Service and drinks were fantastic. I got a coffee made with their pressed coconut milk which was delicious. My boyfriend got a #10 (red taro) dessert drink. He could not stop raving about how good it was. The woman working the counter was super nice and fast with making our drinks. I would highly recommend giving this place try.", "date": "2017-11-20 22:16:58"}, "32": {"review_id": "vOOFFysxslZ0_Yd5TNgyqQ", "user_id": "bqyth2CQ-IowqxQFRqrQ-A", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 5.0, "useful": 0, "funny": 0, "cool": 2, "text": "I was thirsty and just came from the gym! They were fast and friendly!!! The place is sooo clean too....THANK YOU!", "date": "2016-06-14 22:06:30"}, "33": {"review_id": "v5Pz87CxmLV_DLXd4iXFzA", "user_id": "bhubPsUGnzze2uO7pyT0Ug", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Our favorite place for dessert and my favorite drink here would be the coconut milk tea. The che are also good here. They have the best coconut milk tea that I have ever had besides the one is San Jose.", "date": "2016-10-29 17:57:37"}, "34": {"review_id": "cdktoe7Vfzds8FDmuLkZ0Q", "user_id": "heqV8fuYyjDCyRHp9GFmlw", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 1.0, "useful": 1, "funny": 0, "cool": 1, "text": "It is a very bad experience. I came in today, but it took a while until someone greeted me, besides that, the drinks were super slow. I tried the smoothies and it was really sweet. I do not know what the put in the ingredients. Luckily, I was fine after drinking their smoothies. I won`t come back. Super slow and the drinks were just so so, nothing good.", "date": "2016-09-09 00:33:33"}, "35": {"review_id": "TSI5d1glTrBFgj7LUYz56w", "user_id": "rMSsALTxIEWic3i23DG8dQ", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "So Happy that Bambu made it's way to AZ! I have visited twice for the Halo-Halo. It is heaven!! Jam packed with so much goodness, and just the right amount of sweetness. I hope this becomes a permanent menu item.", "date": "2016-09-20 20:55:24"}, "36": {"review_id": "fq9imO-y_0vrtz0bIlRE_w", "user_id": "heqV8fuYyjDCyRHp9GFmlw", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 2.0, "useful": 0, "funny": 0, "cool": 0, "text": "I tried to give this place second chance today but I have waited for 10 minutes and I haven`t got my drink. It is really slow to make tea only.", "date": "2016-09-21 02:36:08"}, "37": {"review_id": "KVhN0ksUmquppNyekzM0_w", "user_id": "Lw1bc6j1HVpM24zaj6dONg", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I honestly can never go wrong with Bambu. I was first introduced to this chain in the bay area, and I have been addicted to it since. I highly recommend the fruit addict. It's suitable for those who are not used to open to trying new things. It cost around $5 but definitely recommend getting it! I also ordered the green pandan waffle. A bit chewier, like mochi, than usual. However, still amazing. It cost about $2.50 and it comes fresh and hot.", "date": "2017-01-06 03:53:46"}, "38": {"review_id": "K0BqDB5y_jj6g_kEppFg6Q", "user_id": "ZnVHNMbe7dSfcymbEDssqw", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "I have actually had Bambu in San Jose and LOVED it. I saw one here in Chandler and decided to give it another go. There was not really any people there and the girl up front didnt seem like she knew what she was talking about when I asked her some questions. I ordered the sour sop smoothie and it tasted flavorless. I guess you can not order anything unless it's CHE.", "date": "2017-04-10 06:42:37"}, "39": {"review_id": "Z0heoqa2x75tKwQzq14inQ", "user_id": "yhXellxEBRE09J6e5DX-tA", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Very clean atmosphere....the prices are a bit more expensive though. Similar to the prices as the Bambu in California. This is the only similar place in drinks as California. I will definitely be back!", "date": "2016-06-25 22:35:32"}, "40": {"review_id": "dhVDxveRjEIJQRwrE4OiFA", "user_id": "4l3mARm_2jyubHN8PPuL1g", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "One of the best smoothie places I have tried. It cost slightly more because they use real fruit, not the powdered crap. Def worth a visit if you want a delicious fresh fruit smoothie.", "date": "2016-06-02 23:09:45"}, "41": {"review_id": "b2GURKQnS9hAoaTkkor4LA", "user_id": "v0b5eT1FRwpK3UpVDjEtqA", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 3.0, "useful": 3, "funny": 1, "cool": 0, "text": "Mixed feelings about this place at this point. I came during their opening week and waited around 30 minutes for a Taro Boba....it was the best (non-alcoholic) drink I have ever had in Arizona so it was totally worth the wait and would garner 5 stars if that was a repeatable experience here. I deliberately drove 30 minutes out of the way just to come here again the next week and had a less than stellar experience. I have been back maybe 3 more times since and it has not been the same. The bathroom is under maintenance a lot, and the drinks can range from excessively overwhelmed with ingredients to weirdly disgusting. The last drink I ordered was sour...which I felt like was done on purpose but I had no idea why? I am still a big fan of their fresh ingredients, but it's just too hit-or-miss at this point. I feel like there should be recipes for making their drinks but I am not getting that consistency...", "date": "2016-08-16 21:15:42"}, "42": {"review_id": "P5PaLpr-tBgNUKBmifGinw", "user_id": "bR7j5ULN5oNEgITfnbbqNA", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 4.0, "useful": 6, "funny": 4, "cool": 6, "text": "I visit this place quite often and I find myself ordering almost the same thing. I did get to try the che ba mau and it was really good. I recommend their green/black teas with crystal boba.", "date": "2017-09-14 17:09:54"}, "43": {"review_id": "SI9NJYaXmS0dmgFgrVKERQ", "user_id": "zFYs8gSUYDvXkb6O7YkRkw", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 4.0, "useful": 64, "funny": 43, "cool": 60, "text": "Enjoying my chè at this San Jose franchise. We popped in today during the soft opening as per Ginger O.'s check-in. We got the 14. Lychee Jello and the 10. Bambu Favorite. Such a refreshing dessert on a warm Sunday! For two desserts, we spent $11.59 after tax. I am excited for Bambu to finally be open after all these months! The storefront is small with limited seating and even more limited tables. It's still nice and clean though.", "date": "2016-05-22 22:21:50"}, "44": {"review_id": "G_X_Aq7WRuVt5tXjte89Qg", "user_id": "e1H_qT2xDJsYo8MvAPtQgQ", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I love this place, the service is always amazing thanks to Kimmie the cashier, she's very nice and fast and she always make my drink which is fresh and good every time I order it.", "date": "2017-07-13 03:15:54"}, "45": {"review_id": "QfaqviXLTVn5ILsjjpXOHg", "user_id": "k34e1m2xfNW9fwFTuWhaOg", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Good service and good boba, I like the number 13, Green bean, it's pretty good.", "date": "2016-10-30 20:59:15"}, "46": {"review_id": "htG1UHPORspRAHYd1LP7gA", "user_id": "9s0619fxzS6M-X4pVS7W_A", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "My milk tea boba choice in Arizona with great options for smoothies and other treats. I am super picky about my boba texture as it just has to have the right amount of chew. Service is always very nice and happy to explain options. Love the iced coffee options as well plus sometimes they have cookies from local bakers.", "date": "2018-05-11 05:45:26"}, "47": {"review_id": "1VwJMo2Ko-TLM8OaZdLmGg", "user_id": "vLWDIy--5vEM6dZcPeWOjA", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Been here twice now, the first time I got a green tea blend and I was not really a fan of it. The second time I went I got ché number 10 and I enjoyed it. I recommend this place. Good for kids has a public bathroom and seating and games.", "date": "2017-07-13 05:22:13"}, "48": {"review_id": "jIoCfLgb30jzRzLOMmgwHQ", "user_id": "koOSl0Hm8lF6NneMfHCZaw", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 5.0, "useful": 1, "funny": 2, "cool": 1, "text": "We travelled over 1 hours after hearing about Bambu from California opened up in Arizona. After that horrid trip with no A/C in a 120° F weather we finally make it to this place. As we step into the shop the cold A/C blowing against the face.... ahhh it felt like satisfaction. This place was crowded, but, everything went by smoothly and fast. The staffs were friendly and speeds things up to get everyone drinks ASAP. We ordered the che #1 Bambu Special (coconut, pandan jelly, longan, basil seeds, coconut juice topped with ice on top) and #15 Thousand Eyes (basil seeds with grass jelly). Overall, they were delicious and quenches our thirst. Would I ever travels over a hour just to go here again? Of course. :)", "date": "2016-06-05 19:05:58"}, "49": {"review_id": "VzCtS4PYNYZZNIq8xwv1KA", "user_id": "aGggZo8Y0SW3vVoEuqjiNw", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I am having the dairy free/ gluten free \"Fruit Addict\" dessert and it's tasty! It's not over the top sweet and you get a medley of fruit/tapioca/jelly in coconut milk.", "date": "2017-11-12 20:51:26"}, "50": {"review_id": "XlCrzx0Ck07HjNj34vY7qQ", "user_id": "ctXFXk9-m6PCMoI-Nz2_XQ", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 3.0, "useful": 11, "funny": 2, "cool": 1, "text": "Of course the only Bambu in Arizona would be located near the only Lee's Sandwiches across the street! As another Yelper had mentioned, I too, was stoked about seeing Bambu being brought down to Arizona and was overjoyed since I miss Vietnamese desserts like Che from Bambu back home in San Jose! One would think such a shop would be a hit in Chandler and added with hot weather would be perfection, but the shop was pretty empty. I ordered my go-to the Bambu Special which consists of pandan jelly, chia seeds, coconut juice, coconut and longan topped with shaved ice. The jelly was chewy, had good flavor but was mostly stuck together and the coconut flesh was a bit hard (mature coconut?) other than that it was okay. Pricing was a bit steeper than usual, about a dollar more than I am used to. The portion was kind of lacking and wow factor was not there. They may be working out the kinks still, but it's good to see something familiar as it's hard to find places such as Bambu out here. Also, I think it would be better if they used an unscented table cleaner instead of the Chlorox-smelling kind they used. While having my Che, some tables near me were being cleaned off and the smell was overpowering and was unpleasant while eating. The pros are that this is one of the only places I know that serves Vietnamese desserts along with smoothies and the like. They accept credit card and have a loyalty/frequent card system. Fast service and clean atmosphere.", "date": "2016-06-27 21:02:04"}, "51": {"review_id": "He0rd6NlFP7pgNf7w-qJ2Q", "user_id": "D_w008i4Xcz9wMU9OVJ3iQ", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 5.0, "useful": 0, "funny": 1, "cool": 0, "text": "I love this place! I used to go all the time in California and now there's one here so I am pretty hooked. Get the Bambu combo!!", "date": "2016-10-06 23:28:32"}, "52": {"review_id": "cjYxNnpb2026J3dhHGW2Wg", "user_id": "3kpoitFg-n7K3DtzSh-Y1A", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 4.0, "useful": 3, "funny": 0, "cool": 3, "text": "We had just finished getting some pho for dinner and looking for a tasty dessert to finish off the night. I yelped for boba and to my delight, Bambu popped up! I had no idea that it's been here since May 2016!! I would frequent Bambu whenever I am back in SF so I was super excited! We pulled into a plaza which also houses Lee Lee supermarket. My husband ordered a taro smoothie with boba. Sadly they had run out of boba, but offered popping boba as a substitute. It's not as soft as regular boba, but has more of a springy and spongey consistency. The taro smoothie was still satiating and had a great taro flavor with the right amount of sweetness. I got the Fruit Addict which consists of longan, red tapioca, jackfruit, palm seed, jello, pandan jelly, coconut meat & coconut milk. Sadly they were also out of pandan jelly. I still enjoyed the drink since I love all the tropical fruit! We had come in near closing time so we were grateful they were able to get us drinks as their last customers of the day. The place is cute, refreshing and I will definitely be back especially during this hot summer!!", "date": "2017-07-04 17:57:26"}, "53": {"review_id": "Gn98c_zoUd-e3klqNEGZ7w", "user_id": "LPva2snYp0Fdu8Z1QIXLiA", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "best place in town for milk tea at a reasonable price!! their oolong tea is amazinggg.", "date": "2016-10-17 23:05:02"}, "54": {"review_id": "VrL3sQDxwBcOY-mfJ6nsQg", "user_id": "vLWDIy--5vEM6dZcPeWOjA", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Been here twice now, the first time I got a green tea blend and I was not really a fan of it. The second time I went I got ché number 10 and I enjoyed it. I recommend this place. Good for kids has a public bathroom and seating and games. The Thai tea is probably my favorite! Yum!!", "date": "2017-07-22 21:01:38"}, "55": {"review_id": "_dYo7l7g9ON-bG0U4zVcBA", "user_id": "eNGIXnzQlIumessyVSaypw", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Absolutely love this place! My favorites desserts are #3, #6 and #10! Oh and I can not forget about the best Vietnamese coffee they have!! It's clear to say I will be a regular here!", "date": "2016-09-23 00:11:37"}, "56": {"review_id": "5oiDQRvsGkHB5TkUWtQ3nw", "user_id": "GyPFTnkGAKWGr7v1ymQNqQ", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I am really impressed with their available selection. never thought I would see a well designed che ba mau cup, can not beat the location", "date": "2016-06-04 19:04:51"}, "57": {"review_id": "XIsqYQcZQqWsjFGxUrczHw", "user_id": "0ibm06KpYdnGL8Ga55w5RQ", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "Heard of this new place on Facebook and decided to give it a try. This place will do good because arizona needs more businesses that serve cold and refreshing drinks and treats. I was not 100% sure of the che but I ordered the fruit addict and it was weird for me because I have never had anything like it before and there was a lot of stuff and jellies in there but it tasted good. My husband got their honeydew milk tea with honey boba and something tasted like what a salon would smell like. We were not sure if it was the smell of the business or if the place used to be a salon, but we kept tasting something funny.. can not quite put my finger on it. I liked all of the different options they had to pick from to put in your drink. We will be back sometime soon", "date": "2016-06-06 03:15:12"}, "58": {"review_id": "NqttICb2nPhR5vItEJbIgA", "user_id": "QZ0vAi1Y17ch24nFVoSzKA", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Delicious! Had the number 12 taro che drink and i enjoyed it. A little on the thicker side and was not expecting that, but I do like the fact that you can choose two topping add-one for free. The owner was also super chill and friendly.", "date": "2017-06-21 02:36:56"}, "59": {"review_id": "Yb5hrkuNpKLu8UK-x30gig", "user_id": "1GW7VjOKmpXmI7dVsVhmYw", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 4.0, "useful": 0, "funny": 0, "cool": 0, "text": "Bamb? is a great place filled with Vietnamese desserts/drinks. I always order the Bamb? special which includes coconut juice, basil seeds, young coconut, pandan jelly, and longans. It's not too sweet, just perfect. The walls and floors looks kind of messed up and dirty. Today, the employee thought I was tricking her when I came in with the check in offer from yelp. It seem like she did not give me the 20% discount or it was not a thing. She did not smile at all but her tone of voice did not sound she was filled with hatred. Going back to the yelp offer, she only gave me the discount for two drinks but clearly it said the whole order and that did not happen. It's fine, but my offer did not say maximum two drinks. I would take off another star but I am not. Hoping my next visit is much better.", "date": "2017-09-27 00:52:07"}, "60": {"review_id": "qN1UgQ-etILS-LaW_aHWtg", "user_id": "ewtL3plKywXuLtmFZoUczw", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "We absolutely love the drinks at BAMBU. They use real fruit in their drinks. They are generous with their toppings, and boba is cooked well. My daughter and i love coming here for our boba fix.", "date": "2018-02-15 16:40:34"}, "61": {"review_id": "RMHizIh0aKqvnAV2mHeDVQ", "user_id": "009U_T7U644EAk5U3Bxmew", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Great tasting natural goodness. They use real fruits / ingredients rather than chemical powders that many of these types of places use.", "date": "2017-05-20 23:36:27"}, "62": {"review_id": "BHJv1JUD2VLGEJVgYA6yug", "user_id": "9p43UPskCYAJSkXLUIOYNQ", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 3.0, "useful": 3, "funny": 1, "cool": 1, "text": "After all the hype about Bambu opening in Chandler, I was so excited to go this place. I went with my husband couple weeks ago, and we both did not enjoy what we got. I got the oolong milk tea, which I think did not taste like oolong at all and overly sweet eventhough I have already requested for less sweet. It tasted more like regular boba milk tea rather than oolong. I know how Oolong taste like, as it is my go to drink when I am in La or the Bay Area.I think Teastreet in Chandler has much better Oolong milk tea. My husband got no 1, the Bambu special. He think it was okay nothing special, but a little overpriced for what you got for $5.75. It feels like something that you can make yourself at home using coconut water and mixed fruits. We might give this place another try again but probably for a little while.", "date": "2016-06-26 23:02:51"}, "63": {"review_id": "4MGyBqtFBEw5ZnN_raX3Kg", "user_id": "bYzLZxneUNSUgMfooHlxiw", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 3.0, "useful": 1, "funny": 0, "cool": 0, "text": "Boba teas and juices. It was nice inside I suppose I expected more variety. Also the girl could not explain to my friend what boba is. On the plus side they have baby bottles with samples of things most people inquire about.", "date": "2017-10-07 07:00:14"}, "64": {"review_id": "KTAQp_UTufDVT6scmeqT0g", "user_id": "tdLsZ2OJuOkjhcaZNZYW0g", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 5.0, "useful": 2, "funny": 2, "cool": 2, "text": "Bambu is awesome. I have never had a bad drink on the menu and the team in there is super cool. My favorite drink is the #9, the red bean special and the Bambu favorite. They take care of my sweet tooth and if I wanted to stay and hangout, I could. Some friends and I have bambu dates instead of traditional coffee dates.", "date": "2018-01-29 03:39:57"}, "65": {"review_id": "zHYjunUaIpxMJ86dbVyH5A", "user_id": "3tTFy3eIAc2_MNTRooiSBA", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I have tried almost everything on their menu, from their dessert drinks, to smoothies, teas, coffee and even the waffles. Everytime I have come in, I have been greeted by warm and welcoming smiles. Everything on the menu is beautifully and deliciously crafted, you can not go wrong with whatever you order! If you need help the staff will willingly assist you in making a decision.", "date": "2016-10-08 02:01:56"}, "66": {"review_id": "4o27dIUMv5MeN-Phi4G3nw", "user_id": "pe3AX1Mw9HCcngmjl02Nxw", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 5.0, "useful": 3, "funny": 1, "cool": 3, "text": "Oh dear, thanks Karen W. for getting me obsessed with this place! I live very close....too close for my own good. They have an all-too-convenience reward points program that also reminds you too often of their existence through text reminders. If I did not like them so much, I would probably be annoyed actually lol. For every $1 you spend, you earn a point. 10pts = free upgrade to large drink and 40pts = free drink. I'd never had a che before so it's been a very fun new treat to explore! I have so far ordered the Fruit Addict (added red beans), Taro Lover (for the hubby) and Bambu Favorite. Not a fan of the Taro Lover. The very very large portion of taro paste in the drink made it unenjoyable. I just enjoyed their halo-halo (a limited time special apparently) today and it was delicious and refreshing! Nice twist to the filipino dessert and feels healthier/less sweet. Thank you Karen W. for letting me know about this new addition to the menu! I will be visiting Bambu far too often for my own good! lol", "date": "2016-06-29 07:44:55"}, "67": {"review_id": "NZ6gXoTi3VKGiZsbvOyRhQ", "user_id": "Q6Dcxo3_lNCzkqK7J3FL7A", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 4.0, "useful": 1, "funny": 1, "cool": 1, "text": "Bambu I still love you but last few times I have come in the quality has not been what I have come to expect. The green jelly has been kind of hard and the coconut slices have also been hard. I ended up feeding the coconut to my dog because I did not want it. I will still keep coming back but if things continue like this I am not sure how much longer that will last... there is a new boba place in my neighborhood that is quickly becoming a favorite of mine!", "date": "2017-11-15 21:57:36"}, "68": {"review_id": "T7pjBRvBC7fcKsefKLy51w", "user_id": "pceN7X_afFDUaZAMf6vDIA", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "I am so glad this place is here since I have moved back from Orange County I can not get che as easily as I did last year. I have been there a few times but mostly I have just gotten the bambu favorite because I love banh lot which is pandan jelly in coconut milk. Definitely a great stop any time during the summer and it's located in the lee lee's plaza where DQ used to be so not hard to find at all.", "date": "2016-07-03 01:23:36"}, "69": {"review_id": "5yXE4LU8NnxxVKgYVJ32mQ", "user_id": "g1OWwQlgnML0ALTPfDtI1g", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "best boba in the valley!!! The people who work here are amazing as well. I would go here every day of I could and they always have new drinks to try! Everything is amazing and I slays struggle trying to only pick one thing when I come in. I would recommend to anyone!!!!", "date": "2017-11-29 19:39:42"}, "70": {"review_id": "32n45xcdzF470SH3GtDJIw", "user_id": "j_j4DLfvNkhCRNWC0VBS9g", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 5.0, "useful": 9, "funny": 5, "cool": 7, "text": "This place is awesome to da Max! I started noticing this place in construction next door to my acupuncture for a few months. I checked for it's progress so many times that I finally gave up. Of course....until I saw other yelpers writing review on this place. BAM! I was here lightening fast. The seating area is a bit small but doable for small party. Most of their drinks have coconut in it. If you are not a fan of the coconut flavor, they also have other smoothies and drinks to choose from. At this point, they do not serve any food or snacks (which is fine by me). They have photos of their signature drinks posted on the wall. It took me a long time to decide which one to get. When my bestie, Karen W, arrived, I decided to order drink #6. Oh boy was it good. It has plenty of coconut juice, huge chuck of coconut meat, 3 different types of jello, lychee and red Boba. I feel like I was having a party in my mouth. After drinking the whole thing, I was pretty much full at that point. I cannot be any happier to see that Chandler, Arizona is slowly becoming like my town Rowland heights in CA. With Boba place around the corner, Glazier snow across the street and now this delicious store for drinks, I am so happy that they are all in here. I will most definitely come back here again.", "date": "2016-05-26 22:56:14"}, "71": {"review_id": "NkSGCH7qlXAUfaI3xQ4Nqg", "user_id": "QKqTuOlzUsstnbqgV_4D4Q", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 4.0, "useful": 2, "funny": 1, "cool": 1, "text": "I have been waiting for this place to open and I am so glad it is right before summer hits. Unfortunately, I was unable to attend opening day but made a point to show my support the following day. Inside is relatively small, enough to fit maybe 4 small groups and a few more since there are chairs along the wall. It was very clean, which is always a plus. I ordered the fruit addict ($5.50 plus tax $5.93) and in a few minutes my order was ready. I took a sip of the coconut milk on its own and thought it was too bland, however, once I mixed everything up and took a bite... it hit the spot on sweetness. It took me back to, driving to get chè in Garden Grove... Oh how I miss home. I typically only get this treat when I go home and visit-maybe once a year. When I had my daughter and my parents came out to visit, I told my mom she needed to open a chè shop in this same exact plaza because there is not one and she literally laughed in my face. Low and behold, almost 4 years later and the one and only chè shop is open in the East Valley. See mom, I sometimes know what I am talking about LOL! I believe this place is here to stay! I wish much success. I can not wait to come back.", "date": "2016-05-27 01:04:46"}, "72": {"review_id": "lJILJYtO7r8z_nnu01ywLA", "user_id": "ma7ZbxGJkGKlyteOnXdytQ", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I am a big fan of boba, but this place has got so much more! At first glance, seems like a simple place, but they have really pumped in the tastiest niche flavors here! The red bean taro dessert smoothie was amazing (although rather interesting to get used to at first), especially paired with the pandan waffle. Comfortable and clean atmosphere, good vibes, and kick-ass prices on some fantastic cuisine. Gotta check it out", "date": "2018-04-22 05:30:17"}, "73": {"review_id": "XyRdHn8fL_kcKVkwAKmHIQ", "user_id": "MmjpF0__57uDNDOkBtL_iw", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "In visiting from CA, super stoked when I found that there was a Bambu near by. Created my own drink with Coconut Milk, crystal boba, pandan jelly, rainbow jelly, strawberry jelly, and fresh coconut. It was everything I wanted except I wanted more! :) the lady at the counter was super friendly and professional. Highly recommend.", "date": "2017-01-22 00:02:16"}, "74": {"review_id": "AwRFeS3m2JK9jM3KuRvXMA", "user_id": "H7x9sZ0aXkI6zU1yy6NuEw", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 4.0, "useful": 4, "funny": 0, "cool": 2, "text": "Went during the soft opening but visited again today so I could officially provide a review. Ordered #3 and #10 ~$10 for both. The #3 Awesome Trio was pretty tasty but very heavy (red and white beans). The #10 that my wife had was actually my favorite as it had a great combination of jelly, tapioca and grass jelly. It had this unique crunch that reminded me of water chestnuts. Overall happy to see that Bambu opened up in Arizona but the one thing keeping this from getting 5 stars is the price. For the size of drink you get the price seemed high. I will likely still return but just not as often ;)", "date": "2016-05-28 04:16:35"}, "75": {"review_id": "Ig_r3AfoxaoAGD2v7ypf0Q", "user_id": "c40DTzCb-fHY6vI03PNRLw", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 3.0, "useful": 2, "funny": 0, "cool": 0, "text": "I stopped by this place after Lee lee's.. I tried the taro lover. It's not bad but very different.. I never tried anything like it before.. I do not know if it was the texture or what.. But overall it was not bad, I will probably stop by here again to check out all the other drinks they offer..", "date": "2016-06-08 22:12:20"}, "76": {"review_id": "roUDLQDZQFRLGl0miinkug", "user_id": "kzIXhINcM6-0rvI221rwcg", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 5.0, "useful": 1, "funny": 0, "cool": 1, "text": "Love this place! I have tried 6 drinks, love them all but fruit addict is my FAV! If I do not live so far away I would be there everyday! Lol I can not wait til they have Halo-Halo tho....*Hint Hint* Ms. Rada. Everyone's super friendly! Especially name, Stacey and Kayla. Definitely my first stop every time I head to LeeLee.", "date": "2016-07-24 21:57:25"}, "77": {"review_id": "9Jv6ASKFFSWfsbsgXOKlPw", "user_id": "-dBnPVMOtcTUR5YDKhH5rQ", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 4.0, "useful": 1, "funny": 0, "cool": 0, "text": "Boba is great and fresh! The selection is just right.however they take wayy too long for a drink long enough to where i had time to sit and get impatient enough to write a review. If youre not in a rush to get somewhere then stop in but if youre on break and need a quick boba, then you did yourself a favor by reading my review.", "date": "2016-09-04 01:49:29"}, "78": {"review_id": "rf0oC3nXOCu2unK8xqqrlA", "user_id": "2MLTkPNp9ldB4YBOi5k4qA", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "From the first opening, the store was already flooded with customers and visitors. A while back, I remember the employees literary refused service to customers who came in at exactly 8:00PM when they were supposed to close. My family and I were the last consumers that they took in. Sitting there and watching 30-40 people leaving without drinks, honestly I felt kinda disapproved. Some people getting out of work around 7:00PM, having dinner, changing their clothes, and finally driving all the way to this place just to see they refusing the service at 8:00PM sharp? There were still people hanging out at the place, but the gal and the guy still stayed put. Customers will be unhappy and money will be going down to the drain.  However, I was impressed by how much improvement this place is getting. Hours of operation were altered, less sugar was put into drinks and desserts, discounts and promo were indicated. The lady boss is always sweet, as well as the front desk. Drinks may be not good sometimes, but customer service will decide 90% of the success. Until this moment, my family and I are quite regulars here, and we get absolute satisfaction every single times. Salut to the management team which devoted and dedicated commitment to put customers as priority. About the drinks, number 1, 5, 6 and 11 are always our favorites. We will see you tonight, BamBu :)", "date": "2016-09-27 16:59:10"}, "79": {"review_id": "wyW55XFZ5Vqtgo4jYzuLqw", "user_id": "zAIevZeZDSHJqm6OIpoZWw", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "On my first visit I was taken captive by the unique blend of real fruit smoothies unsurpassed by any where else I have ever been. I was also impressed by the smiles serving us...made me wanna open a Bambu in California, then I found out they already have many there...hallelujah!", "date": "2016-09-14 01:02:05"}, "80": {"review_id": "XQ__IOUTDizHeJkjobFgPQ", "user_id": "9jsBpPA-1h6ZPxxm01Za-w", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "This was my first time to BAMBU, and my first time ever trying boba. Let me tell you, I was not disappointed! My husband, sister-in-law and I all ordered the taro smoothies with bursting boba and they were delicious! My brother-in-law order the Fruit Addict, which contains lychee, longan, red tapioca, jackfruit, palm seed, jello, pandan jelly, coconut & coconut milk. It looked like quite the unique treat and he seemed to really enjoy it. Even though they closed at 9pm on Sunday, they allowed us to stay and chat until a quarter past. There is plenty of seating inside or out. There are also board games available to play while you eat. All in all, I would highly recommend this establishment for a smoothie fix with or without boba!", "date": "2017-07-18 00:15:39"}, "81": {"review_id": "x7aGTkygJSr6NwWy3-ZVKA", "user_id": "HW06q76Uvt0iC2u2w2wT8g", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 4.0, "useful": 0, "funny": 1, "cool": 0, "text": "I was super excited to try this new place since my go-to drink spot is Boba Tea House. I tried the fruit addict and really enjoyed it! The blend of different fruits and jellies with coconut milk is super refreshing and not too sweet. My favorite thing by far is the strawberry fresh fruit tea! It's so delicious! The tea itself is not very sweet, but the fresh strawberry on the bottom with the basil seeds is sweet enough to balance the whole drink out. The tapioca balls were not nice and chewy, but more on the mushy side. Because of that I would stay away from the boba and stick to their speciality drinks and teas.", "date": "2016-06-30 21:15:52"}, "82": {"review_id": "DgsVX6qUE3i7-E6eABqJGA", "user_id": "zjE_s-f-Ol5M7hlDrZ1tSw", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Very friendly, great vibes when walked in. I love the pictures of all the different selections of items on menu. Well, that's because I am a visual person, I need to see what my food looks like. I must say, it's everything I expected it to be. I have #6 Fruit Addict- so so delicious. It reminded me of all the good desserts in Thailand put together in one cup.", "date": "2017-01-21 19:37:09"}, "83": {"review_id": "R03gSHtuhFXrc0buajrLeA", "user_id": "2H9ycVc0gJYlpUtBnLXi_w", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 4.0, "useful": 0, "funny": 0, "cool": 1, "text": "Cute, clean little place. I always order the same #1. Dessert is more on the sweeter side so I request less sweetened. Nice customer service.", "date": "2016-10-11 17:59:07"}, "84": {"review_id": "Fm8YCcNpIKOwVxmFwCngjw", "user_id": "fo8x5c1IX46F0JeCVnFaQQ", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "This is an update since I have been here easily 25 times since their grand opening. I found out that I actually love the #1, which consists of fresh coconut juice, longan, basil seeds, coconut pieces, pandan jelly, and I like to add in red tapioca for extra texture. It's the right amount of sweetness, it's refreshing, and I am hooked on it. The staff is so friendly and always has a smile on their faces, which lifts my spirits after each visit. They have added so many other items on their menu and I can not wait to try more so I can see if there's a new favorite that exists!", "date": "2016-09-15 22:31:17"}, "85": {"review_id": "Fn1LEoW0RbqCspypS90jLg", "user_id": "H6HS5pZDrnc4HG7eWYz6nQ", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 5.0, "useful": 1, "funny": 0, "cool": 0, "text": "My new favorite spot! Just had #6 Fruit Addiction. Tastes really refreshing and especially great in 100+ degree weather. My friend had the yogurt honeydew which has a slight tart flavor but also so yummy! I will for sure be back soon and can not wait to tell my friends!", "date": "2016-06-09 01:01:01"}, "86": {"review_id": "1E4gxMOU1zfuobS_aQms3g", "user_id": "DK57YibC5ShBmqQl97CKog", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 5.0, "useful": 18, "funny": 15, "cool": 20, "text": "I love the influx of new Asian cuisines and desserts coming to the Phoenix area! Bambu is a refreshing drink and dessert shop specializing in chè, or Vietnamese style dessert. Yep, it's chè, and not Che the Argentine Marxist revolutionary (He probably did not drink too much bubble tea or pandan jelly drinks back in his day). The shop is small but the variety is large. They have several coconut milk and coconut juice drinks that include various fruits, jellies, and boba, as well as bubble tea and coffee drinks. I went for the #1, a dessert with coconut juice, shaved ice, longan, basil seed, shaved fresh coconut, and pandan jelly. It was a light tasting drink that is good for someone that does not want something super sweet and is looking for more hydrating refreshment. All the components tasted good together, although the pandan jelly's slippery texture was a little weird to me. I had a taste of the #6 which had coconut milk which was more \"dessert-like\" with rich coconut milk, fruit, and various jellies. On a hot day this shop will definitely be a favorite way to cool down. I will be back!", "date": "2016-05-27 01:08:42"}, "87": {"review_id": "-2LeB_uhE6DOuWvhU6u09w", "user_id": "ItDygc9-l13ZyuLjPw9RQg", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Yay Bambu is finally here in Arizona!!! Ok people you have to try this place out. I love this place....I am seriously here 3-4 times a week!!! This place is awesome. If you are looking for a light desert after lunch, dinner, or just a refreshing drink thru out the day. You have to give this place a try. I had try almost everything on the menu... Everything taste delicious!! I love their salted caramel coffee. I know that does not sound good but trust me it taste yummy plus the milk teas is also pretty good too. I love black tea with milk and some grass jelly, egg pudding. All their employees is very friendly... A plus", "date": "2016-07-01 21:45:08"}, "88": {"review_id": "OkzNfdugVjs1PfdW-WqGTA", "user_id": "MhMijIAVx1Is_WYIMTHn6w", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 5.0, "useful": 0, "funny": 0, "cool": 1, "text": "Finally a location in AZ!!! Having been to locations in SoCal and Vegas, I could not wait for this location to open after seeing the coming soon signs on my way to China Magic Noodle House. I went on opening day at around 945pm. According to Yelp, Bambu was posted as open. The location really closes at 9pm Monday to Saturday, and on Sunday at 7pm. However, we were greeted nicely and I was able to place the last order. The owner (?) at the cashier was very friendly. The price is on par with the Irvine, CA location. The quality and the taste are as good if not better than the other locations I have been to. What is different about this location is the ability to make your own custom drink with up to 5 add ons. The names of the drinks are different than other locations but the \"preselected\" drinks are essentially the same. The location is small with only a few tables, but I usually get mine to go anyways. Bambu, welcome to Chandler!", "date": "2016-05-26 05:20:08"}, "89": {"review_id": "jPZSEakhSBbeksLLK-KmWw", "user_id": "cJlBhBSc-_FJFa_ubY9P0A", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 5.0, "useful": 1, "funny": 1, "cool": 0, "text": "We tried this place out despite what our friends said about it for their first experience. All 3 of us agreed that we loved what we ordered. We were not going in expecting anything but first of all: we had excellent customer service from the owner, she explained how they make the coconut milk fresh everyday and that all of the ingredients are not bagged and processed (which is what you would get with normal halo halo) and I loved knowing that the ingredients were fresh and not in a jar for who knows how long? she even let us try the lotus seed as we were a little skeptical on what that would be and let us replace it for coconut jelly without an extra charge. I got the fruit addict. My girlfriend got the Awesome Trio. And my best friend got the Coconut Lover with coconut jelly in place of the lotus seed. We loved how refreshing they were and not too sweet to our tastebuds. Each one of them rated it 5 stars and we will definitely be back. :)", "date": "2016-06-08 23:56:04"}, "90": {"review_id": "Idz-4FH7nc6eUMFbhStUgQ", "user_id": "gvEpn7KNgjjM4P-ymGtiCQ", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 5.0, "useful": 1, "funny": 0, "cool": 1, "text": "I am in love with this place! We tried the passion in love smoothie and you can actually taste the different kind of fruit flavors in there, it's amazing! I also got a Vietnamese coffee which I like, better than Starbucks lol no bitter after Taste, strong yet sweet. The only thing is do not stop by in a lunch break because it takes a little longer than most places, but we do not mind since it was good! Will definitely be back and will tell all my friends to try it!", "date": "2016-06-19 01:55:02"}, "91": {"review_id": "dRkvWBPIhWzl-UgPfh1bIQ", "user_id": "dlOYCLB7XKORL-BE9lnPnA", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 3.0, "useful": 0, "funny": 0, "cool": 0, "text": "After months of waiting, Bambu is finally open. This place specialIzes in Che which is a Vietnamese dessert made usually with mung beans, black eyed peas, kidney beans, tapioca jelly and fruit such as jackfruit, lychee, durian and longan. The store is small with limited tables but clean. After looking on Yelp to see which Che to get, my fiancé and I ordered #3 Awesome Trio and #6 Fruit Addict. The Awesome Trio had Red and white mung beans, taro, pandas jelly with coconut milk. The Fruit Addict has red tapioca, panda N jelly, lychee, longan, jackfruit, Palm seed, coconut and coconut milk. I usually order Che when I got to a Vietnamese restaurant and love it. However I was not really impressed by the Che I had. I thought it lacked flavor and it was kinda bland. Overall I give this place a 3.5 just because I really did not enjoy the smell of this place when I first walked in. The smell reminded me of a bathroom and it was lingering which made it unpleasant. I also did not like that the menu was blinking and going blank then coming back on , especially when your trying to order. However the service was good and our order came out fast. I know this place just opened so they are still in the process of figuring out all the kinks. I will be back to try some of their other drinks and update my review later.", "date": "2016-05-29 04:50:25"}, "92": {"review_id": "yArdG3C0BsdWdT_chK2hDA", "user_id": "1d03pRgiEZs8ERVnJIAhnA", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 2.0, "useful": 3, "funny": 1, "cool": 0, "text": "I do not write reviews but just thought I'd do it for this one since it was over hyped.  The casher was friendly but lacked the knowledge about what's in the drinks so it felt like a learning experience for both sides.  I was the last in line for my drink and after everyone's order quickly came out I finally got mine 15 minutes after the two people in front of me got theirs.  I ordered a passion fruit tea which probably contained half a cup of syrup. Good thing I do not get sweeteners for my teas because it was extremely sweet.  Their Vietnamese coffee is whatever. You want better coffee? Go across the street to Lee's sandwich. The fruit addict was the only thing decent. While not great but better than what anyone else has to offer. Overall it's a place I'd probably just glance at and maybe stop by when I am tagging along with other people.", "date": "2016-05-29 23:32:16"}, "93": {"review_id": "V06YfYvWOwVKysLEFW2zbw", "user_id": "Q6Dcxo3_lNCzkqK7J3FL7A", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 5.0, "useful": 4, "funny": 3, "cool": 4, "text": "I have been waiting and waiting for the Phoenix area to get a Bambu! I love the dessert drinks at this place. My favorite is the #1 Bambu Special that has longan, green jelly, basil seed, coconut meat, and coconut water. It's super refreshing and kinda has some health benefits too on top of being delicious (basil seed is very good for you). My very picky boyfriend who does not typically like Vietnamese dessert even liked this drink. Thanks so much for bringing this place to Chandler!", "date": "2016-06-10 22:24:23"}, "94": {"review_id": "mr1ghJOdPbUnbUm7D3aTvA", "user_id": "P1uzXKqwdslSurU-sJpSAA", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "This place is awesome! I personally love their fruit smoothies :) the thing that keeps me coming back has to be the friendliness off the staff and definitely the freshness of the drinks! 5 stars for sure!! If you get a chance give them a try.", "date": "2016-09-29 17:11:49"}, "95": {"review_id": "NUJZbUmFV73XtUYZrHfG_w", "user_id": "lYu0e98ZSNeXIjcLpkjhhA", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 5.0, "useful": 0, "funny": 1, "cool": 0, "text": "I have passed Bambu many times while traveling to Lee Lee's Market next door. Out of pure curiosity, I ordered a Fruit Addict ché. It contained an abundance of sweet ingredients, many of which I have never tried before: longan, jackfruit, and pandan jelly. At first, I could not tell if it was a drink or a dessert eaten from a cup. The fruit are sliced in generous pieces so getting them through a straw is not an option. Do not forget to grab a spoon when you order one of these! Overall, I absolutely loved my order. I usually feel bloated from drinking dense, creamy boba teas, but this ché did not do that. It is so much lighter and refreshing. The bursting flavors were out of this world; every time I am reminded me of ché, I crave it. Sadly, Chandler is a long drive away and I really wish something like this existed in my hometown. Next time I am in Phoenix, I am definitely stopping by again.", "date": "2017-12-02 03:41:56"}, "96": {"review_id": "sxYyaBwWi_vvSAZ1EuQCDg", "user_id": "M-l73CoJ7nvHxW0jfqCl5A", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "I love that place. My fav place when summer comming. I love #6. Fruit so fresh. This place is quite. Service fast and nice.", "date": "2017-07-28 01:57:30"}, "97": {"review_id": "0_dOEO47OpA-1SvzA61xtQ", "user_id": "fo8x5c1IX46F0JeCVnFaQQ", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 4.0, "useful": 3, "funny": 3, "cool": 1, "text": "I woke up at 2 a.m. to feed my baby when it hit me....holy crap, today's the day Bambu officially opens! I have been looking forward to this day since being 8 months pregnant and wished with all my pregnant-craving-might that it would open sooner rather than later....and the day was finally here! I made sure we went there early to be their 1st customers, just to find out they had a soft opening the week before. Super sad face. BUT...we were still their 1st customer on their official grand opening today and I am certain Mia is their youngest visitor at a whopping 3 weeks old, so I am happy. ^_^ The owner, Rada, is super cool, and I wish nothing but great success for what is to be Phx's # 1 go-to spot for che (Vietnamese ice dessert 'drinks'). Seeing as they are brand new, there will be kinks they need to work out and I am sure the place is not completely finished, but that do not bother me none. The tables were clean and my only suggestion is to have some fun games to play. (i.e. Jenga, Connect 4, Rock 'em Sock ' em Robots, chess, etc) as I forsee this as a great place to bring the family, meet friends and chill. On to the che review! My oldest daughter and I both ordered the #6 (Fruit Addict) which had everything I could love....longan, lychee, jackfruit, coconut meat, toddy palm seed, pandan jelly, red tapioca, and coconut milk and juice. Sooo yum and very refreshing. My hubby got a milk tea with crystal boba, and my younger daughter got a Raspberry Rama with crystal boba and added fresh mangos on top. The youngest had breastmilk, but that was not on the menu. Lol. Everything together (4 drinks) cost $17 & some change. We loved it and can not wait to try out the other flavors!!! We will definitely be back.", "date": "2016-05-25 21:26:15"}, "98": {"review_id": "eorPVIUJAZpubTCL06bfeg", "user_id": "I_t7fCIf2LpGOGw-yKjM9Q", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 5.0, "useful": 0, "funny": 0, "cool": 0, "text": "Yummy coconut smoothie, nice atmosphere and friendly staff. Came all the way from Albuquerque, NM and it was worth it!", "date": "2018-04-13 22:12:08"}, "99": {"review_id": "m6_SPeSvC18mUktUWumzGQ", "user_id": "bEoO-sftOZCuII9911dw4A", "business_id": "mSqR24h_nKXyMhwtWSih3Q", "stars": 2.0, "useful": 0, "funny": 1, "cool": 0, "text": "Did not even taste it yet, I only stirred the crushed ice up and this is the amount of goods in the reg size cup that I paid $7 for. Not satisfying at all.", "date": "2017-10-01 21:43:29"}}